[
  {
    "headline": "Thursday, 16 October 2025 - Volume 788",
    "publicationDate": "2025-10-16",
    "summary": "Almighty God, we give thanks for the blessings which have been bestowed on us. Laying aside all personal interests, we acknowledge the King and pray for guidance in our deliberations, that we may cond...",
    "topicSummaries": [
      {
        "topic": "KARAKIA/PRAYERS",
        "content": "SPEAKER: Almighty God, we give thanks for the blessings which have been bestowed on us. Laying aside all personal interests, we acknowledge the King and pray for guidance in our deliberations, that we may conduct the affairs of this House with wisdom, justice, mercy, and humility for the welfare and peace of New Zealand. Amen.",
        "tags": []
      },
      {
        "topic": "Rt Hon James Brendan (Jim) Bolger ONZ, PC",
        "content": "SPEAKER: Members, I regret to inform the House of the death on 15 October 2025 of the former Prime Minister Rt Hon James Brendan (Jim) Bolger ONZ, PC. Jim Bolger was the member for King Country from 1972 to 1996, and then for Taranaki - King Country from 1996 to 1998. He was Prime Minister from 1990 to 1997.",
        "tags": []
      },
      {
        "topic": "ADJOURNMENT",
        "content": "Rt Hon CHRISTOPHER LUXON (Prime Minister): I move, That this House place on record its appreciation and gratitude for the devoted and distinguished service to New Zealand by the late Rt Hon James Brendan Bolger, Member of the Order of New Zealand, member of the Privy Council, member of this House representing King Country from 1972 to 1996 and then the renamed Taranaki-King Country electorate from 1996 to 1998, who served as Minister of Fisheries from 1977 to 1978, Minister of Immigration from 1978 to 1981, Minister of Labour from 1978 to 1984, Leader of the Opposition from 1986 to 1990, and as New Zealand's 35th Prime Minister from 2 November 1990 to 8 December 1997, and who later represented New Zealand as Ambassador to the United States from 1998 to 2002, and that this House express our sorrow and our sympathy to his wife Joan, their children and wider family, and that as a mark of respect, the House do now adjourn.\n: We remember today a devoted husband, father, and grandfather. Jim Bolger was a farmer from Taranaki, a proud New Zealander, but most of all, in the context of this House, we remember a former Prime Minister whose innate sense of fairness helped him make the right choices, at the right times, for the right reasons. In doing so, he helped New Zealanders become more confident in our nation's unique sense of identity.\n: Born in 1935 to a farming family in Ōpunake, Jim came to politics via what was then a very traditional training ground for National MPs, namely the Federated Farmers in provincial New Zealand. He joined the National Party and was elected the member King Country in 1972, a seat that he held until he left politics. Becoming leader of the National Party in 1986, the context for National's electoral success in 1990 was deep economic uncertainty and the unpopularity of the previous Government's economic reforms. Bolger's Government and the Labour Government that preceded it, ushered in a new era for New Zealand, creating the open, confident country that we are today.\n: As Prime Minister, Jim led New Zealand through sweeping economic, social, and constitutional changes, from major fiscal reform, including the \"mother of all Budgets\", to industrial relations transformation, and to overseeing the early stages of Treaty settlements.\n: He was a strong supporter also of New Zealand's place in the world. He backed our alliance with the United States but respected the will of New Zealanders and maintained our nuclear-free stance. He strongly opposed nuclear testing in the Pacific and he helped reshape our foreign policy to be more outward-looking, more engaged with Asia Pacific, an approach that still guides our Government today.\n: The landmark Employment Contracts Act brought New Zealand's industrial relations into the modern era. As Jim said, \"Gone are all those stupid stoppages I had to deal with day after day. We used to keep the press gallery waiting outside in the cold while we resolved the dispute, then we had a beer, and then we told the journalist what the resolution was. It was important\", Jim said, \"to do things in the right order.\"\n: He guided the country through the transition to MMP, a system he accepted as the will of New Zealanders.\n: One of the defining moments of his premiership was the 1996 Heads of Agreement with Ngāi Tahu. There were doubts within the National caucus, the cost was high, the politics uncertain, and it was an election year, but Jim had an instinctive grasp of New Zealanders' innate sense of fairness. In his view, it was the right thing to do and he urged Cabinet to go ahead. That moment, and the Treaty settlement process it helped cement, stands as a proud legacy of his leadership.\n: He had a strong team around him, some of whom still serve in this House, and I've heard stories of long, late-night caucus meetings with a bit of arm twisting where needed, but also stories of loyalty, camaraderie, and deep respect. They didn't call him the \"Great Helmsman\" for nothing.\n: Jim never lost his humour or his humility, and in his valedictory, he opened by saying, \"I know there's some interest in what I'm going to say, but perhaps even more interest in how long I'm going to say it.\" He then thanked the Labour whip for the offer of another glass of water and said he was sure he would need it, and perhaps, as he went on, he might need something even stronger. That wit, along with his Irish charm and his fondness for a quiet evening's whiskey, remained part of his character throughout his life.\n: After leaving Parliament, Jim continued to serve, notably as Ambassador to the United States. I wasn't in the room for those diplomatic conversations, but I have no doubt he made an impact, whether speaking with a Kiwi drawl or, as some suspected, adopting a touch of the American accent mid conversation.\n: I didn't have the privilege of knowing Jim well personally, but since becoming Prime Minister, I received a few quiet phone calls from him. They were short, sincere, and thoughtful. He offered encouragement, perspective, and advice—advice that I took seriously. I also remember campaigning with him in a bar in Waikanae and him still holding court in a room full of people, sharp as ever, fully engaged, loving politics, and very much enjoying himself. He'd just turned 87.\n: Not long ago, he celebrated his 90th birthday, surrounded by family, including eight of his nine children. He and Joan, who has stood steadfastly by his side since their marriage in 1963, were immensely proud, and rightly so.\n: On behalf of the Government and the people of New Zealand, I extend our deepest condolences to Jim's wife Joan, his children and grandchildren, and all of those who knew and loved him.\n: In closing, I want to use Jim's own words, written just a few weeks ago after the death of his friend Tā Tumu Te Heuheu. He said, \"He was, in simple terms, a very good person who was interested in helping others. Farewell, old friend, and may God welcome you home.\" Those words now speak for Jim himself. Thank you.\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\n: The Labour Party joins with the Government in paying tribute to Jim Bolger, the 35th Prime Minister of New Zealand. I vividly remember the very first time I ever met Jim Bolger in person. I was in the sixth form at Hutt Valley Memorial College. Jim Bolger was the Prime Minister and New Zealand had just won the America's Cup. I was one of the lucky few students selected to come and be part of the official welcome reception for the victorious America's Cup team as they arrived home in New Zealand. While everyone else was rushing around the room, gathering the signatures of the victorious sailors, I was collecting the signatures of all the politicians—there were warning signs even back then!\n: But I met Jim Bolger and he was incredibly generous with his time. He took a genuine interest in younger New Zealanders. I think he asked more questions of me than I asked of him, and he was genuinely engaged and interested in the answers. He wanted to understand how New Zealanders saw what was happening in our country at the time and what we thought needed to happen in the future.\n: I wasn't hugely political at the time. I didn't really understand politics very much. That changed relatively quickly over the next couple of years as I went to university and found myself, a couple of years later, out the front of Parliament chanting some rather unsavoury things about Jim Bolger and his Government at that time. Not long after that, Jim Bolger quit Parliament. I'll claim all the credit!\n: But, actually, it was his quitting of Parliament where I got my first taste of election campaigning, because I quickly got involved in politics, ventured up to the King Country by-election, and went doorknocking in Hāwera. I can tell you, as an aspiring Labour Party activist, doorknocking in Hāwera is not a great place to start! We came third in the by-election, but I'm still here.\n: But it was some years later when the gods of Air New Zealand ticketing seated Jim Bolger and I next to each other on a flight to Hamilton and then back again later on that day, that I actually had the opportunity to have quite a long conversation with him. He was flying to Hamilton to chair a University of Waikato Council meeting and I was flying up there to do some education-related visits.\n: I remember that it was late 2016 or early 2017, because the topic of conversation was dominated, at that point, by a certain US presidential election. He was deeply concerned about rising inequality, increasing polarisation, and the fact that so many people around the world seemed to have lost the ability to disagree with each other agreeably. We spent our time sitting together on the plane talking about that.\n: He could see that the concentration of wealth around the world was unsustainable, that the growing marginalisation of large segments of our society was leading to us becoming more divided, and that we could not continue to stand for that. He spoke, in his retired life, of the moral failure of prisons, and I totally agreed with what he was saying there.\n: I think perhaps growing up during the World War II and the long shadow of its aftermath meant that he was very, very aware and had a deep appreciation of the need for us all to constantly strive to find common ground and reconcile our differences. In the conversations that I had the privilege of having with him, we did manage to find a lot of common ground and I enjoyed all of the subsequent encounters that I had with him.\n: He would refer to me as young Chris even once I'd become Prime Minister, and he had a knack for offering his insights and wisdom without ever coming across as patronising or condescending. He did seem genuinely interested, not just in my political career, which he clearly had been following, but in the political careers of emerging politicians across the House. I think perhaps it's a wisdom that you get after you leave this place, that recognition that Governments come and Governments go, but the good interests of the country do rest with whomever the Government happens to be at any given time. He remained a mentor and a friend to anyone in this House who sought out his guidance.\n: From the conversations that I had with him, though, I did get the sense that he struggled to reconcile his own values with the consequences of some of the things that happened during his time in politics, including during the time that he was Prime Minister. I've subsequently come to accept that that's a bit of a curse of all political leaders who happen to be in the hot seat during times of significant turmoil. It's perhaps the ones who don't wrestle with their conscience later on that we should worry about.\n: Jim Bolger's life is full of contradictions. His Government sold the Bank of New Zealand and then he was the inaugural chair of the new Government-owned Kiwibank. His Government ushered in the Employment Contracts Act and then subsequently he chaired a working group that led to the establishment of fair pay agreements. His Government did more to weaken unions than just about any other, but then in his later years he lamented how small unions had become and the effect that that had had for working people.\n: He sacked Winston Peters from his Cabinet and then formed New Zealand's first MMP coalition with Winston Peters as his Deputy Prime Minister, a Government that transpired to be remarkably stable, much to the frustration of the then Labour Party Opposition. I do want to acknowledge Winston Peters today, the only remaining member of the House who served in Government with Jim Bolger during the time that he was Prime Minister. I also acknowledge you too, Mr Speaker. Your first election victory was Jim Bolger's last election victory. I don't think we'll read too much into any of that.\n: His passing marks the end of an era, but his impact on our nation and our politics will endure for many generations to come. His work to advance Māori and progress Treaty settlements does deserve special mention. I know how much he's held in high regard on marae and with iwi up and down the country. In one of his last interviews, only a couple of weeks ago, actually, ironically with a younger member of the Labour Party, he spoke of his concern that so many New Zealanders now seem scared of the word \"Māori\". He reminded us that when Māori do well, we will all do well. He also offered a sobering warning that until the injustices of the past are addressed and Māori are thriving, we will never be able to truly leave behind our past conflicts.\n: He grew up in Taranaki, was a farmer, and led as Prime Minister with pragmatism, often making tough decisions, but always with a clear vision of the country's future. He understood that the country is not just measured by its GDP or its trade figures but by the health and wellbeing of its people. He believed in Catholic social justice, and I know that his faith was important to him. He was a stoic, accepting that while no leader can ever choose their circumstances, they can choose how they respond to those circumstances. He had the serenity prayer hanging on the wall in his office. He was a staunch republican. He turned down a knighthood on leaving Parliament. He advocated for New Zealand to make its own way in the world. I think it's a huge tribute to him that he was nominated for New Zealand's highest honour, the Order of New Zealand, by a Government comprised of his former rivals.\n: Outside of his time as Prime Minister, he remained deeply involved in public life, always committed to improving the lives of ordinary New Zealanders. Humble, dedicated, passionate—his legacy is woven into the fabric of who we are as a country today.\n: I was reflecting that to some extent his passing bookends that of Mike Moore a few years back. Mike Moore was our last working class Prime Minister, leaving school with no higher qualifications. Jim Bolger remains our last true farming Prime Minister, also leaving with no higher qualifications. Both rose instead through their hard work, political nous, and deep understanding of the lives of ordinary New Zealanders, and their stories remind us that leadership is conferred not by degrees or by titles but through character, conviction, and service.\n: To his family, particularly his wife Joan and his children, I offer my deepest condolences and to the many who knew him and worked alongside him and admired him, you can all take comfort from the fact that his influence continues to guide us and will continue to guide us in the years to come.\n: I thought it was fitting to end with an Irish Catholic proverb recognising his cultural heritage of which I know he was proud: \"May the road rise to meet you. May the wind always be at your back. May the sun shine warm upon your face, the rain fall soft upon your fields. And until we meet again, may God hold you in the palm of his hand.\" Nō reira, tēnā koutou, tēnā koutou, tēnā koutou katoa.\nTEANAU TUIONO (Green): Thank you, Mr Speaker.\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\n: On behalf of the Greens, I rise to support the motion and to support the tributes to the Rt Hon Jim Bolger. In doing so, we understand that for the entire nation he was a Prime Minister, he was the great helmsman, he did many great things, but first and foremost he was a husband, he was a parent, and he was a grandparent. We would like to acknowledge that he had a big whānau and was a koro many times over. Our thoughts are with his wife, Joan, an Aotearoa community leader in her own right, who worked hard doing travel work and public speaking. We'd also like to send our aroha to his children:Dan, Paul, Brian, Stephen, Bernadette—tēnā koe e hoa—Fiona, Rachael, Matt, and Aidan, and his 18 grandchildren. He had a big whānau who will be hurting today, and I know that they will be missing their koro for many, many years to come.\n: As I was scrolling through social media, I saw many tributes from many Māori communities—communities that he helped to support navigate the Treaty settlement claims. As I looked at the size of his whānau, I had to think that perhaps his deft ability in being able to work with many Māori communities was because he had his own iwi and he had his own hapū. It is on that understanding, I feel that many Māori felt that as well.\n: The Rt Hon Jim Bolger served as Aotearoa's Prime Minister between 1990 and 1997. He held several ministerial positions, being the first Minister of Fisheries, the Minister of Immigration, and the Minister of Labour. He was known for his intelligence and his strong debating and negotiating skills. He also wasn't afraid to work across political lines during Kiwibank and working on fair pay agreements, both under Labour-led Governments. The Hon Chris Hipkins did talk about a demonstration and protest outside that was protesting against his Government, and I think I was there—except I was one of those ones that wasn't collecting signatures from politicians at that particular time.\n: He oversaw some significant reforms, including the introduction of the MMP system—and acknowledging the Rt Hon Winston Peters from those times as well, and that Cabinet as well—the resource management, as well as the first major Treaty of Waitangi settlements in Tainui and Ngāi Tahu. I know that for those iwi in particular, he will be at the forefront of their minds.\n: He believed in Te Tiriti, historical justice, and a collective responsibility to honour our founding agreement. When people questioned him on why Treaty settlements, he responded by saying \"Because it is the right thing to do.\" I read that he reflected on his wife, Joan, who, attending school with children from Parihaka, and him attending Ōpunake School next door, never learnt the history about the land that they were on and what happened at Parihaka. He advocated for us as a country to learn our history and own it, warts and all.\n: I think there's an important lesson for all of us there, as political leaders, as well, because we know that there are ups and downs in this particular place, as well, but being able to navigate those different pressures and to come out the other side and, at times, reach out to the other side of the political divide to work on things like fair pay agreements shows the strength of the man. It also shows that, even in his later years, people who were his friends—and political enemies, may I say?—would continue to reach out to him for advice; this is a mark of a truly remarkable person.\n: I want to just leave us with this quote, which I was reflecting earlier on today. And that is this: \"We should teach our colonial history, because we don't, and this is a huge mistake. You cannot know who you are as a society unless you know your history. Look out across the world and see the extraordinary divisions within societies.\" There are some messages and some lessons from his tenure in this place but also the work that he did outside of Parliament.\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\nHon DAVID SEYMOUR (Leader—ACT): I rise on behalf of ACT to join other leaders in support of the Prime Minister's motion honouring and acknowledging the life and times and legacy of the Rt Hon Jim Bolger. As others have said, he was a man of a great family. Our thoughts are with Joan, his nine children, and his extended family, who, we all know as politicians, will have made great sacrifices in order for him to contribute to our country.\n: Many people will know the history very well—the changes that occurred in the 1990s, bedding in and continuing a process of economic reform that brought New Zealand into the modern world, and the reconciliation that occurred through the Treaty settlement process, without which, New Zealand today, would be unimaginable. And yet, it's so easy to forget how brave and difficult starting that process of Treaty settlements would have been in 1992.\n: He also presided over an enormous constitutional change where the way that New Zealanders elect their representatives to this House changed, and the structure of New Zealand politics changed with it forever. All of that history is well known. I, myself, am separated by two generations, as a person and as a politician, from Jim Bolger, so I don't have the richness of personal stories that others may be able to tell. However, this morning, on hearing the news, I consulted with some who had served and worked with Jim Bolger for their insights into what that was like and what sort of man and what sort of politician he was. They said to me things like: he was a person with a deep sense of the value of belonging; somebody who had a sense of fairness that could only be described as innate; somebody with a keen respect for the underdog; and somebody who felt a responsibility, not only to bring New Zealand into the future but also somebody who had a deep sense of responsibility to do the right thing. He was somebody who encapsulated many of the qualities of a politician that so many politicians themselves would like to be remembered for and so many people around the world, in so many different countries, would like to see in their leaders. That is an extraordinary legacy, one that we should all be very grateful and gracious to acknowledge in the House today.\n: Our finals thoughts are with those he has left behind. The entire Te Kūiti and King Country community, I know, will be feeling this deeply, as will his extended family and, particularly, Joan and his nine children today. Our thoughts are with them, and our gratitude is to him for the legacy that he has left the modern New Zealand. Thank you, Mr Speaker.\nRt Hon WINSTON PETERS (Minister of Foreign Affairs): Today, our thoughts and condolences are rightly with Jim Bolger's family, his wife Joan, their many children, grandchildren, and the rest of his extended family. As a Catholic man of Irish extraction, he will have taken both solace and pride in being surrounded by his large family during his final moments. He could have asked for no better farewell.\n: As always, there are various views of history, but very few have had the benefit of living it, breathing it, and working on it like Jim. Therefore, it's right for this House to acknowledge Jim Bolger's passing. He was, ironically, a republican serving his King Country electorate for 26 years, from 1972 until 1998. As you know, he served as Prime Minister for seven years, leading three terms of Government, which were markedly different to each other in their complexion and their output.\n: Jim is acknowledged for his pride in New Zealand's independent national identity, and the presence of the national museum, Te Papa, here in Wellington is due in large part to his insistence that an institution that tells our history and engenders young and old to take an interest in their history was needed. Again, he was proud of his Irish ancestry and saw an historic parallel in the treatment of Irish nationalists with the mistakes of some former New Zealand Governments with Māori in New Zealand. As a Te Kūiti farmer, he grew up around Māori and saw no reason for difference and every reason for communities to be stronger together.\n: It's often said that Jim Bolger was the last Prime Minister without a university degree. Well, for our sakes, we must hope that that is not true for the future. Jim learned his craft on the farm and in the town halls, and he applied it to the highest elected office in this country. In his earliest years in Parliament, he earned the title \"The Woolshed Orator.\" Jim Bolger was a man of good character, strong morals, and family values; he called for a decent society in 1990, and he did so for good cause. He was, in his own words, \"a red-blooded Irishman by descent, but a very practical Kiwi by practice.\"\n: Now, we were not without our disagreements, but today is not for recalling those moments. Disagreements are, however, fundamental to the democratic project, and that was always understood by Jim. He happily took part in a healthy democratic discussion throughout his life, and, long out of politics, he later reminisced on the raging ideological disputes of his time as Prime Minister and had the reflective courage to admit that mistakes were made. It's true to say that, 29 years ago, in 1996, we formed the first MMP Government. We—he—put differences aside, shook hands on that agreement, and, more importantly, he kept his word.\n: Today, we can and must acknowledge that Jim Bolger contributed to a time of enormous difficulty economically and change to New Zealand. But, of far greater importance than this, we acknowledge the passing of a husband, father, and grandfather. Jim, may God bless you.\nDEBBIE NGAREWA-PACKER (Co-Leader—Te: Pāti Māori):\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\n: I rise on behalf of Te Pāti Māori to acknowledge the passing of the Rt Hon Jim Bolger. We have lost so many great pou this year.\n: Mr Bolger was a Roman Catholic, his politics informed by doctrines of peace, forgiveness, and reconciliation. He also lived near whenua beside Parihaka in Taranaki\n: [Authorised reo Māori text to be inserted by the Hansard Office].\n: [Authorised translation to be inserted by the Hansard Office.]\n: His work around the Cabinet table gave life to the principles of good faith and goodwill unto all. We'll remember Mr Bolger's commitment to restoring the honour of the Crown under Te Tiriti o Waitangi. He knew Te Tiriti o Waitangi promises a place for all in this country, and that we all have love, and should have love, for each other. His leadership serves as a lesson: not to vilify or burn bridges with Māori communities but to embrace each other in the spirit of peace through justice, together owning our past and collaboratively looking towards our future.\n: Te Pāti Māori wishes to honour Mr Bolger in his Catholic tradition with this prayer.\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\n: Mr Bolger knowingly expanded political capital for the nation's progress and to address historical injustices. His disposition is described by many who we also spoke to as magnificent, as inclusive, and as, indeed, a proud Irishman—earning him the nickname \"Spud\". For us, Mr Bolger is regarded as the greatest Prime Minister since Michael Savage. He had a legacy that affected the whole country. He heard and saw te iwi Māori.\n: Mr Bolger resisted pressure from what we understand was nicknamed the \"Rat Pack\". I won't name them, but names such as Bill English, Nick Smith, and others were included in it, and it was part of them pursuing neoliberal asset sales. The people who rang us today to make sure that we were sharing some of their stories were part of Government at the time, and the stories that they have to share talk about the actions and indeed—as a previous speaker said—ensured that he knew the art and the dignity and the respect of healthy debate, and when it was time to make sure that we could find a way forward no matter what your politics or parties were. The way that he was able to be a visionary and fight for things ensured that we actually have key national assets that we protect as part of national sovereignty, and that we collectively protect today.\n: Mr Bolger supported Doug Graham in signing historic Treaty settlements with Waikato-Tainui and Ngāi Tahu. Tukoroirangi Morgan rangatira said that Jim Bolger leaves a legacy in the Treaty settlement space that will remain unsurpassed. He modernised the whole process of reconciliation in an effort to bring Aotearoa and New Zealand closer together.\n: In 1995, the people of Parihaka also were met and included by this wonderful man. He had the highest ideals of humanity. He acknowledged Parihaka and its peace and its justice, and that Tohu and Te Whiti were way ahead of their time. He also made comments that are embedded and will remain with Parihaka for as long as we are alive. He acknowledged that peace and justice in New Zealand should be honoured—that is the legacy of Te Tiriti. He remarked that we cannot build a nation on myths of equality that ignore our history, and history delayed must still be history delivered.\n: Te Pāti Māori offers its deepest condolences to the Bolger whānau. We also know that there will be many iwi and hapū who are saddened to hear of his passing.\n: In his later years, Mr Bolger became an adviser and a close confidant of many iwi throughout the motu. Over the coming days, his name will be heard across a number of paepae, recognising his contribution to race relationships, and that ideal towards reconciliation are peace and justice.\n: We will mourn his passing and remember his legacy with deep gratitude and affection. E te rangatira, moe mai rā.\nHon PAUL GOLDSMITH (Minister of Justice): Thank you, Mr Speaker. I'll start by acknowledging the Bolger family at this time of loss. Our thoughts and prayers are with them. The word that comes to mind, in relation the former Prime Minister Jim Bolger, is \"decency\". He was a Minister, then Leader of the Opposition, then Prime Minister through some of the most tumultuous times in recent history—times of fierce antagonism—and he came through with most fair-minded people regarding him not as a divisive figure but, instead, as one who brought people together. He could build relationships with people who might have regarded him as the enemy. He was a man of faith.\n: Much has been covered of his career, but I would point out that his first election as Leader of the Opposition, in 1987, was a catastrophic loss, and yet he carried on. It was a different era; he wasn't cast out, and he went on to take the party to a stonking victory in 1990. He was a good manager of Cabinet, and he referred to his experience wrangling, with Joan, nine kids; being able to keep the peace; and move the family along. I think it was similar with the Cabinet; he had some salty characters. My first connection with him was during writing a biography of John Banks, who caused him no end of trouble over his time in Cabinet. I came across a quote from Banksie's diary, when he said, in caucus, \"Sometimes, Mr Bolger, I say things that must really piss you off (the caucus erupted).\" That's how he managed to hold the Cabinet and the caucus together.\n: The media and the country often gently—or not so gently—mocked him as \"Spud\". His plane was Spud One. \"The Great Helmsman\" has been talked about, the way that he said \"confident\" with a K, and the way that he adopted overseas accents when he was overseas. He was never super popular as Prime Minister, but he was respected, and that, in the end, is the most important thing.\n: If we think of his legacies, his biggest, I think—well, a big one—was the contribution to the effort to restore the nation's finances during the 1990s. He'd been part of the Muldoon Cabinet that had resisted change and necessary reform up to 1984. Then, he had to deal with, as Leader of the Opposition, the reforming Labour Government that turned the political landscape upside down, where they almost lost Remuera in 1987. Then he had to confront the dire economic situation in 1990.\n: He didn't approach issues ideologically. He never set out to redesign the State, but he was a realist, and he confronted the scale of the challenge he inherited and faced the problem head on. He didn't flinch when it was not what he would have liked it to be, and pain was acute through 1991 and 1992. Progress was just sufficient for National to get re-elected in 1993, by a whisker. Remember he said, \"Bugger the pollsters.\", at the 1993 election, when they got back in by a whisker? But he led the country through strong period of growth in 1994 and 1995.\n: Another legacy was MMP, and some people will say that he broke a promise he should have kept with the superannuation and kept a promise he should have broken with MMP, and time and history will determine whether that was correct. He also failed in his efforts to make the nation a republic, but at least he tried. But more successful, of course, was his effort in starting Treaty settlements, particularly with Ngāi Tahu and Waikato-Tainui.\n: Jim Bolger, as said, grew up in a small town in Taranaki, in a predominantly Māori community, and was always comfortable amongst Māori. His instincts were fair-minded, and, with Doug Graham and his Cabinet, he set the nation on a process that, 30 years later, is still ongoing, and for which, we continue the work today.\n: Few countries have tried such a thing, to face historic events head on, to acknowledge, and apologise for past misdeeds. It's a process that requires much grace, particularly on the part of Māori, who received back a fraction of what was lost, but, also, to some extent, to the people of the current generation, who are setting aside resources that could be devoted to them right now to settle the sins of earlier generations. He and that generation of Māori leaders, in the 1990s, set us off on an important course, and he will always be remembered for that.\n: Unlike the US system, where presidents often end their second term at the height of their popularity, the New Zealand political system, like the UK system, generally ends with Prime Ministers ending in failure, living by the sword and dying by the sword and being tossed out. John Key, I suppose, would regard himself as the only exception to that. Jim Bolger fell to a coup, but after the dust settled, he no doubt understood that he had achieved a lot for the people of New Zealand.\n: He was \"The Great Helmsman\", and he took his turn at the wheel and steered through many squalls confidently and competently, and we wish his family all the very best.\nHon Dr MEGAN WOODS (Labour—Wigram): Tēnā koutou e te Whare. E Jim, moe mai, moe mai, moe mai rā [Rest in peace, Jim]. I rise with the rest of the House to acknowledge the life and the legacy of the Rt Hon Jim Bolger, and to extend my deepest sympathy to Joan and the Bolger family. Losing someone is never easy, regardless of their age or their health. Today, we honour a man whose contributions to Aotearoa New Zealand were both significant and enduring, and I would like to acknowledge his colleagues and those who have worked with him over the years.\n: Jim Bolger was a leader who, it has been writ, confounded expectations. He once remarked that his life was full of ironies, a reflection on his journey from privatising rail in the 1990s to later chairing its renationalised successor; and, as Chris Hipkins had said, from selling the Bank of New Zealand to later chairing Kiwibank. These ironies were, however, not contradictions but evidence of a man who evolved, a man who listened, a man who acknowledged change in his thinking, acknowledged his mistakes, who was open to new thinking, and a man who led with conviction. In an increasingly politicised and polarised world, Jim Bolger's life reminds us that it is possible to work constructively and respectively across political divides. We do not need to agree on everything to find common ground—and this was one of his great strengths.\n: Jim Bolger challenged and confounded me at two pivotal stages of my life. Firstly, as a student at the University of Canterbury in the early 1990s, I held very strong views about the policies of his Government. The \"Mother of all Budgets\", welfare cuts, and the Employment Contracts Act 1991 were deeply at odds with my values. However, it was a lecturer in the history department—a lecturer in New Zealand history who I greatly admired and respected and still do—Tā Tipene O'Regan, that presented a different view of Jim Bolger. In Tā Tipene's Treaty history honours class in 1995, right in the thick of the Ngāi Tahu claim negotiations, I was presented with a view of a Prime Minister with a deep understanding of our history who was prepared to listen and genuinely wanted to address the wrongs of the Crown - Māori relationship. Tā Tipene spoke to us of a man who did what he believed was right, even when it meant standing up to his own team.\n: Years later, as a new Minister, I began regular meetings with Jim in his role as the chair of the Gas Industry Company. These continued throughout our six years in Government, and I always looked forward to these meetings every 12 weeks. His wit, his warmth, his humour, his inquiring mind, and his willingness to engage in robust, respectful dialogue were qualities that I deeply admired. We didn't always agree, it's fair to say, but that was never a problem. What mattered was our constructive relationship, that was built and grounded in mutual respect and a shared commitment to public service. Jim understood, perhaps better than most, the challenges of being a Minister and governing. He was always genuine in that desire to be helpful, and I valued his insights immensely. I also appreciated his fondness for lingering a little longer after meetings, telling his chief executive that this was the \"any-other-business\" section of the agenda and he wanted to indulge in a bit of political gossip.\n: As the member for Wigram, it would be remiss of me not to acknowledge Jim Bolger's role in chairing Kiwibank: a lasting legacy of my friend and predecessor Jim Anderton and a testament to both of those men's belief in a strong, proud, and independent New Zealand. Jim Bolger was a gentleman of New Zealand politics. He led, he listened, he evolved, and he served. Today, we honour his life and his legacy and the example he sent to us all. Thank you, Jim, and may eternal rest grant upon you.\nTĀKUTA FERRIS (Te: Pāti Māori—Te Tai Tonga):\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\nHon TAMA POTAKA (Minister for Māori Crown Relations: Te: Arawhiti):\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\n: When we talk about leadership we often look to the Beehive, to the House, or to the halls of power, but, for Jim Bolger, leadership began in a far simpler and humbler place, at Te Namu, often referred to as Ōpunake—the home of many legends, particularly Wiremu Matakātea, Peter Snell, and my mother. Places around there like Oaonui and Ōeo, Hukunui Manaia—named after Hukunui Manaia—and others, in the grandiose \"Surf Highway 45\". Some people, like our hat-wearing friend Rawiri, talk about State Highway 35, but Debbie and me, we're \"Surf Highway 45\". That's where Jim Bolger was from. Those small coastal towns where he was brought up, Ōpunake and Rahotu, beneath the gaze of Taranaki maunga shaped a man who would go on to lead a nation, a man of respect, a man of responsibility, a man of redistribution, a man of relationships, a man of reciprocity, and a man of mana. It's also a town and a village, Rahotu—just down the road from Parihaka, the location of some of the Crown's most egregious and vicious behaviours against our people in Taranaki—the suspension of habeas corpus and various other measures that symbolise the rule of law. This is rich symbolism given the achievements and the attainments of Jim's contributions in public life, and, today, I celebrate his conviction, and I celebrate his devout determination to serve in the interests of all New Zealanders and to go forward together.\n: Jim told me that he was nominated for the National Party candidacy in the King Country in 1972. He was very late for his nomination, and he was one of six—one of whom was my wife's grandfather, Brian Jones, the son of Pei Te Hurinui. He won that nomination and went on to serve. His maiden speech, of course, spoke of the great reassessment facing the world in recognition that progress must serve people, not just economics. He saw beyond that partisanship, calling for balance between growth and human wellbeing. Of course, that same clarity would define his approach to Te Tiriti o Waitangi, the Treaty of Waitangi. When he came into his great responsibilities, Māori issues were often seen as marginal debates rather than central to the nation's wellbeing. I acknowledge the references, the other evening, in relation to both the te reo Māori petition and also the great hīkoi led by Dame Whina Cooper, and might I also mention the Takaparawhau reimagination that lasted over 500 days.\n: The Waitangi Tribunal's power to hear historical and herstorical grievances was still new when he came into responsibility, and the country was still learning to listen. His approach, alongside people like Bill Birch, like Doug Graham, and, of course, Minister Peters and the Speaker, who were in service of the communities in the country that we serve, in the 1990s. The settlements have been mentioned, but also, beyond the settlements, he observed that those moments in history are not just about winners and losers; they're about reconciling our history and our herstory so that the people of this great country can move forward together with confidence, with determination, with dignity, and with clarity. It's not just signing a document or signing an agreement in principle or deed of settlement and drawing a line under our story; it's also about opening the future possibilities, whether or not that was in his service in Te Urewera with the Te Urewera board, that groundbreaking legislation that enabled Te Urewera to have its own legal identity and personality, but also in the reconciliation redress provided to Parihaka in 2017 and his mahi, alongside Dame Tariana Turia—e mihi ana ki a ia—over there in the west coast.\n: Jim said, \"You cannot build a future on injustice. If you want peace and reconciliation, you must acknowledge the truth.\" Those words are not simply for his time but resonate today. He presided over the recognition of Te Wānanga o Raukawa and Te Wānanga o Aotearoa as wānanga under the relevant education legislation. He also presided at a time when Māori broadcasting emerged. He did not posture. He listened to diverse voices and made space. You saw the transition to MMP, as has been mentioned today, that has ushered in an era of our parliamentary story where there are more Māori MPs than ever before.\n: He wasn't a radical. I remember meeting Jim Bolger for the first time when I was 8 years old in the Raetihi school hall, and my father and I and others had to perform a Ngāti Toa Rangatira ngeri for Jim on his arrival at that time. From what I recall, it was actually the night of the 1984 election—not a fantastic night for the National Party, but a great night to meet Jim Bolger. He wasn't a radical, but, indeed, his leadership and his legacy have enabled a radical transformation of our country, in my humble opinion, for the better. The strength of our nation—as witnessed and heard on his recent conversations with the Hon Nanaia Mahuta on YouTube, if you want to check that out—doesn't just come from the 120 or so of us that sit in this House, in this debating chamber, but from families and whānau, from communities, groups, and organisations, from workers, from business people, and from the different threads that go through that needle.\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\n: There is but one eye of the needle through which these threads must all go. He understood that Māori prosperity and the health and wealth of Māori would lift national prosperity and New Zealand prosperity, and that social obligation, economic growth, and spiritual connection are not enemies. They are partners. They live together. These actions demonstrate his commitment to the country, his values and, what I particularly reflect on, respect for whakapapa, for our land and moana, for people, responsibility to act fairly, to deliver on promises, to hold ourselves to account, and also for kotahitanga, where our development, our nation's development, whānau wellbeing, conservation, and economics are not traded off too far against one another—pitted off against one another—but are combined together.\n: He lived, in words of our colleague the Hon Megan Woods, with conviction that progress does not require us to abandon our roots but to affirm and to grow them. As Minister for Māori Crown Relations, Māori Development, Conservation, and Whānau Ora, I carry those challenges and those messages closely—to treat the Treaty not as a relic, but as a living foundation to address the needs of our people and not to just sit in ideology but to drive for outcomes together. We won't build peace by ignoring our past wrongs, or build kotahitanga by amplifying or continuing our divisions, but we build, according to Jim, by facing them, by listening, and by honouring our obligations to one another.\n: My grandfather Ivan Len James worked on the farm of Jim Bolger's father and mother at the back of Rahotu—I won't get into the translation of that word, but maybe the translator can translate for you. He reminded me that Jim was someone who was of the land, for the land, and for the people. Tēnā koutou katoa.\nHon WILLIE JACKSON (Labour): Kia ora, Mr Speaker. It's an honour to pay a tribute to Jim Bolger. It's been all so wonderful listening to all the kōrero today, but one of the things that I think that's been missed in the kōrero, with respect, is that Jim Bolger, I felt, had an incredible wit.\n: As you know, Mr Speaker, he had great, great humour. The last time I saw him—and I always liked to go up to him and have a bit of a chat—I said to him, \"You know when we were in the union movement, Jim, we hated you with a vengeance—you know, like we hated your guts.\" He said to me, \"Willie, tell me something new—tell me something new, I've heard it all before.\", and I said, \"Oh, OK. Well, I've got something new for you there, Jim. When we were in the union movement, a number of us younger guys had all sworn that if we saw you on the street, we'd punch you right between the eyes. It was either you or Muldoon.\" He laughed his head off. He said, \"Is that your Māori or Pākehā side coming out?\" I said, \"Definitely Pākehā side!\"\n: So I remember him with all this wit, and people talk about him being such a contradiction—I mean, he destroyed us at union level. You know the Employment Contracts Act. There was a time, as you well remember, Mr Speaker, that when you joined a job, you joined the union. You know, there was no option in those days. I loved those days—bring back those days, I say.\n: I was a young, militant union official, and this bloke Bolger turned up and he was the Minister of Labour. Oh man, and in those days, if you thought we had the hīkoi march—that was huge, as we all know—there were marches to rival those hīkoi marches. Bill Andersen, Ken Douglas—this was the union movement at the time. We all swore that we'd get to Bolger, but we were all unsuccessful, as you well know. I just thought, \"One day, if I ever catch up with this Mr Bolger\", and one day, I did. It was in a Jim Anderton - Labour Government, and old Jim, for some reason, he'd had a sort of a turn-around. He became our chairman of Kiwibank. Later on—I mean, we're talking about someone who oversaw the fair pay review—I said to him, \"I didn't think you were the same bloke.\", and he goes, \"I was always the same bloke. You know, I'm Jim from Te Kūiti, where your mother was born, Willie Jackson—where your mother was born.\"\n: So those sort of reminders and his sort of style, it just really showed you that someone could cross over, and he is a person who crossed over, as we've heard today. I want to say to everyone, it's great when we hear this type of kōrero because, in my view, Jim—and I've heard particularly from Te Pāti Māori, I love some of that kōrero coming out—you're talking about the most significant and influential National leader of the last two generations with regards to Māori and race relations.\n: I want to mihi to him in his whānau today: to his beautiful wife Joan and to his daughter Bernadette, who worked with us when we were Ministers. A wonderful, wonderful family, and, as he said, \"It's the Irish and the Māoris, Willie. There's a connection there.\", and I have to agree.\n: But it was a fascinating life—and what a life. Who would have believed that someone who left school at 15 years old, with no qualifications, goes on to become the Prime Minister and the Leader of the National Party? You know, we want more of those sort of people in the National Party. We're hoping—myself and now Chippy, our leader over here—that one day that will happen.\n: It is such an opportunity today to mihi to him and his whānau and to his contribution, because his commitment in terms of te ao Māori has to be remembered. His courage has to be saluted. I think all the speakers have done that today—all the speakers have done that today. It was courage, and I heard \"Goldie\"—or Minister Goldsmith, I should say—talking about it. It was not an easy time back in 1995-96 to actually bring the Treaty settlements together. We can sort of kid ourselves and say that \"Oh well, everything's wonderful now. Tipene's got $2 billion in terms of Ngāi Tahu, and Tainui is flying.\", but Māoridom were protesting in 1995-96, like you would not believe.\n: My uncles Sid and Moana Jackson were leading a lot of that protest in terms of what the Government was doing. But the Prime Minister held to the principle that justice had to be redressed, had to be settled, and although 2 percent of a settlement or of a loss didn't really go to where it should have done, because for—and I heard Megan Woods talking about Ngaī Tahu. the Ngāi Tahu settlement was worth $16 billion to $18 billion. That's what the economists told us, and they settled for $170 million. They settled because of the leadership and innovativeness of Tipene. They settled also because of the strength of Jim Bolger and Doug Graham and a National Government who, I think, and who Māori believe, should be remembered and should be saluted—and that's a lot coming from me, Mr Speaker, I tell you.\n: But we remember that time well. We remember that time well and although there was protests and although the settlements were not where they should have been, we had a Prime Minister who was fixed on justice, who was fixed on redress, who was fixed on Māori getting the acknowledgement they deserved because he believed that if Māori were strong, then this country would be strong. And I salute him. I salute his courage, his whānau, his people.\n: [Authorised reo Māori text to be inserted by the Hansard Office.]\n: [Authorised translation to be inserted by the Hansard Office.]\nBARBARA KURIGER (National—Taranaki-King Country): Thank you, Mr Speaker. It's a privilege to stand in the House today and speak, as the current Taranaki-King Country MP, on the death of James Brendan Bolger. It's been a very sad and difficult week for the King Country. The heavens have opened this week. There have been five roads, at least, closed and devastation in our community. One can't but help whether this is significant, followed by the death of our previous member of Parliament and Prime Minister.\n: For those who have walked through the street of Te Kūiti in recent years, you may have seen the legends gallery on Rora St. The legends gallery is testament to six legends. We call Te Kūiti the town of legends. It's also the shearing capital of the world, Mike Butterick! We have six people who we really hold in high esteem: Dame Rangimārie Hetet; Les Munro, the Dambuster; Jim Bolger; Koro Wētere; Colin Meads; and our one living legend who is still alive, David Fagan. Those are our local legends in Te Kūiti.\n: There's a history with the Taranaki-King Country electorate. Jim Bolger was elected to Parliament in 1972, as you have heard today—that was my last year in primary school. There has been one member of Parliament between Jim Bolger and myself, and that was Shane Ardern. So, for 53 years, the King Country has been represented by the three of us in various formats before and since MMP. The one significant thing that may not have come to most people's attention is that we all went to Opunake High School, all three of us. It's probably a coincidence, but something very special that we share and something that the school is very proud of.\n: The other thing was that Jim Bolger and I were both members of Rahotu Young Farmers at different times. We were in debating teams, obviously at different times, but he was a great mentor to the young farmers who came along post his time.\n: All of his life, he has been a contributor to society. I can remember as a young married couple with our young family, we hosted a potluck dinner with the Prime Minister the Rt Hon Jim Bolger at our house in Ōaonui. That was when the Taranaki-King Country electorate came all the way round to where David MacLeod's  current electorate is. So that was a significant event, and little did I know that, a few years later, he would be one of my predecessors as I then stood for Parliament.\n: What is also little known is that my husband, Louis, has an auntie Anna who is married to Paddy Bolger, who is Jim Bolger's brother. So, in a way, Jim is whānau.\n: It was a great pleasure when I first came into Parliament, for Jim's 80th birthday. My EA Samantha at the time—Samantha Laming—was a great cakebaker, so we asked her to make a cake for the Rt Hon Jim Bolger for his 80th birthday. She was very nervous, as you can imagine, for a young EA. So I rang Auntie Anna, and I said, \"We're going to decorate a cake for Jim. How should we decorate it?\" She said, \"I think there are two options: one, you can either make it in an Irish theme; or the other theme I would give you is 'don't fence me in.' \" We ended up making it in the shape of a leprechaun hat and made it very Irish. To Samantha's credit, it was great. We took it up to the 19th floor of Bowen House, to Chris Finlayson's office, and we had coffee and cake. It was a wonderful occasion.\n: So it's been a pleasure to be in the electorate. Jim is held in high esteem. I had his desk for quite some time, and we did ask him if he wanted it back. It is now with Ko Wai Au, which is a whānau community support group, a non-profit community organisation, which is very fitting.\n: It's really interesting: somebody sent me this little box a few years ago, and it was presented to the Rt Hon James B. Bolger, Prime Minister, on the occasion of the launch of the Hellenic New Zealand Congress, Parliament Buildings, 2 September 1995. They said, \"Can you find a way to get this back to Jim Bolger?\" And I said, \"Yes.\" So I picked up the phone and I gave him a call. I always appreciated his phone calls and I knew I could pick up the phone and call him when I needed to, too. I rang him and he said, \"Barbara, I think I have enough things at my house. I don't think I need to collect any more things.\" He said, \"You can hold this and you can look after this for me.\"\n: So he's obviously a very well-respected man. I will say in the comments today from Debbie Ngarewa-Packer and Tākuta Ferris, I went to Opunake High School, as I mentioned, a number of years after Jim Bolger, and we didn't know much about Parihaka when I went to school, either. So it was a sad history and I'm really glad that people like Jim Bolger has been able to contribute to where we have got to today, and may we continue in his legacy.\n: The last thing I just want to do is to wish the very best, and pass on my regards, to his wife, Joan, and his family. All his family are contributors. When Jim left Parliament, he didn't stop contributing; he was contributing right to the point where he just couldn't contribute any more.\n: So rest in peace, Jim Bolger. You can be sure you will remain a legend in the King Country, and we will never forget you. Thank you.\nTIM COSTLEY (National—Ōtaki): I'm going to miss \"Sir Jim\", and I know he wasn't a fan of knighthoods, but when we met, I told him he'd been Prime Minister for seven years and I was going to call him \"Sir\". We compromised on once a day, and so that's my one done.\n: Jim grew up on the farm in Taranaki, just down the road from my mum's family, and I first met him, actually, at my gran's funeral. He'd been a bit busy during my teenage years running the country, but I remember thinking it was pretty cool that the just recently retired Prime Minister would turn up to my gran's funeral.\n: But the thing I learnt about him, and Joan, to be fair, is that they always took the time. If Mum or Uncle Brian were in town, they'd take the time. If I was calling in to visit but I had the kids, it was never a problem. They would take the time for a cup of tea or, if it was after 3, maybe a glass of red wine, or there might be a loan of the trailer to take the green waste to the tip. In fact, when I was overseas with the air force for a few months, he got in touch, suggesting that maybe he should go around and take all my green waste to the tip for me. I said that there was no way I was having a former Prime Minister turn up and take my green waste to the tip, and I got home and saw how much there was and regretted that.\n: But he was always making time for others, whether it was local events or both of my election nights. In fact, in the last election, he had sent me a message saying that look, he had all the family around and he wouldn't make it to our function. But Joan tells the story that an hour in, as the results were coming in, he stood up and announced, \"Right, we're off.\", and they came down and joined us at the Waikanae Bowling Club—very fond memories.\n: They were always making time for others. He was still active right up until the end, helping our council, helping community groups, helping the local Catholic church, and still enjoying frequent visits from the media—I'm not sure we always enjoyed them, but he certainly did.\n: My good friend Chris Bishop was reminding us this morning that when he and Nicola came to run a public meeting with me just a few years ago, after they had finished speaking, there were the usual questions and answers. Maybe five minutes into the questions, Jim came to the front and gave what, with all due respect, now reminds me of committee of the whole House speeches because it wasn't really a question. There was no question mark at the end of it and it went on for quite a while. But, eventually, the questions did start; it was just that they were from the floor, and not for Chris or Nicola. They were for Jim, and he was away.\n: Do you know, I think most residents on the coast have been to a business breakfast or a public meeting that's been hosted by Jim. A lot of the time he hadn't been invited to host them, but inevitably that's where things ended up. I think for people—and maybe my electorate has a slightly older average age than many, but I think they just shut their eyes and it took them back to the 1990s and, while we joke about it, I think they felt safe. I saw how deeply respected he was and how deeply loved.\n: There are many who will feel this loss far more keenly than I will. I think of Joan—perhaps his greatest accomplishment in his 90-plus years. They were an amazing couple. In fact, when they found out one night that Emma, my wife, couldn't come with me to a National Party function—no, they were sending around the Bolger grandchildren to babysit, and from there on in, we were never short of babysitters. I'm not sure Emma appreciated losing the excuse to not turn up as much as Jim and Joan intended, but they always made the time, and do you know what? He was still blue to the core. Sometimes you had to scratch a little further—as we've heard—in his later years, but he was blue to the core right until the end.\n: The phone rang late on a Saturday night just a couple of weeks ago, and I said to Emma, \"I'm not answering it. It's way too late.\" Then I saw whose name was on it—\"OK, I'm answering it.\" Jim always took the time for me, with the regular text messages and phone calls. I would get a summons round to the house if we hadn't caught up for a couple of weeks and we'd chat about the issues of the day, and I'd listen to many stories from his time at the top, as well.\n: Actually, they were often stories from his time as a Minister under Muldoon. He'd talk about being sent overseas for six weeks with almost no accountability. \"It was fantastic.\", he said, and that's when he got to meet the then Vice President George Bush Senior. But it was experiences like that that set him up for the first few years of his time as Prime Minister—he talked about being one of the only small country leaders that had a direct line into the White House—and, of course, for his time as our Ambassador to the US, as well.\n: Perhaps the story I remember the most leads me back to where I started, back in Taranaki. He talked about in 1996, I think it was, when people came to him and said, \"What are we calling Mount Taranaki?\", or, as it was then, Mount Egmont. \"You have to decide, Prime Minister. What's it going to be? Are we going to change from Egmont to Taranaki?\", and Jim in, I think, his deep wisdom said, \"Just let people decide. If they want to call it Egmont, call it Egmont. If they want to call it Taranaki, call it Taranaki.\", but he could see the culture shift that was happening.\n: There was not just that deep wisdom but that strategic patience in that, and I think it has been proven right three decades later. Jim knew that people needed time to adjust and that you can't force instant intergenerational change on people—it doesn't work. Big changes are made one step at a time, and they are far more effective if everyone takes one step together, rather than just a few taking many.\n: The challenges we face today are different, but they're actually kind of just the same. As he said, \"You don't win the battle to lose the war. You can avoid the battle and we can win the war together.\", and I think Jim won many times over. He won for Māori, he won for farmers, he won for a nuclear-free Pacific, he won for the man and woman on the street—whom he understood so well—and he won for Kiwis.\n: He was a leader. He was a leader that preferred to make the right decision over the popular one, and who was willing to wait for the best outcome and not rush into the wrong one, and I think that as a result, maybe he's one of our more underrated leaders but also one of our more respected ones, both because of his values and because of the values that we all hold as a nation. Perhaps there's a lesson in that for all of us.\n: He taught me that when we enter this esteemed House, we need to move from protester to parliamentarian, and that to be a true statesman and a leader takes patience as well as persistence. It takes grace and gravitas; conviction and compromise. It's not just about tearing down people in this House, but building up all of those who live outside of it.\n: So when I look at Mount Taranaki, I remember that Jim showed us a high road. It may be a little longer, it may be a little windier, and it may be a little bumpier at times, but it has room for us all to journey together. Perhaps in this moment—even just for a moment—we can take one step along that road together towards the future that Jim wanted for his family and for ours.\n: To finish, I say to Jim's family in this sacred moment that we think not just of his contribution to country but his commitment to family, right back to when you were all squeezed into that station wagon on those long drives home. We send our love to all of you, and there really are a lot of you, but we send you our love as we mourn your granddad, your father, and your husband. Rest in peace, Jim.\nSPEAKER: I want to thank the House for those very fine tributes to the great New Zealander, and, if the House will indulge, make a few comments of my own.\n: I first met Jim Bolger in 1987, and through the subsequent years, saw him at many party functions and was a great admirer of his. He came to a campaign function for me in 1996. Perhaps demonstrating the sort of gentle Irish charm that he had and the warmth that he exerted, when meeting my mother, who was only 5 foot 3 and a very, very petite woman, he looked at her and said, \"How on earth did you end up with a brute like that?\"\n: He was, in his time, a great parliamentarian. He offered a lot of advice to young members when they came in here; we were only with him for a couple of years, I have to say. But one of the things he said is that yesterday doesn't have to be today, and so many of the tributes today, I think, have indicated exactly how much that thought process was guiding him over that period of time.\n: I do want to thank everyone for mentioning Mrs Bolger. She was his rock for such a long period of time, and he delighted in telling people the story of how they met. I won't go into that—that's for someone else. But what I can say is that when I heard that story a number of times, the joy in his eyes was no less for each time that he told that story, and I think that wonderful partnership is something that the whole country should celebrate. I do offer condolences to Joan and to the family for what they'll be feeling at this time.\n: I think I have to say, too, that Jim Bolger loved convivial situations. He loved gatherings of people. He enjoyed, as any true Irishman would, the opportunity to be with other people.\n: I recall that shortly after the formation of the 1996 Government, Doug Kidd invited a number of senior Ministers and members to the Speaker's Lounge for ongoing discussions, which you can imagine involved a lot of, you know—well, basically they loved their whisky. Doug pointed at me and said, \"You come too.\", and so I did, but I found out I was only there to be the waiter.\n: I was quickly dispatched by Jim Bolger to go and find Ian Revell, who played a guitar. He said, \"Get Revell, get his guitar, get him back here. We're going to sing some songs.\" He loved singing—and it's interesting you mentioned that song, Barbara. He did a three-chord version of \"Don't Fence Me In\"—something that I'll never forget—and then a number of Irish songs.\n: But then he dragged everybody out on to the balcony just outside the Speaker's Lounge, drinks in hand, some smoke ascending above their heads, and then he led the group in a resounding rendition of \"Danny Boy\", and you just think to yourself, could a Prime Minister do that today? I'm talking about the whisky, Chris!\n: The reality is that he was able to be himself with those who he worked with. Too often, I think, we have to hide that away because of the malicious nature of social media these days.\n: So we have lost a great New Zealander—no question about that. He was a man of deep Catholic faith. May perpetual light shine upon him. Rest in peace, good and faithful servant.\n: Motion agreed to.\nSPEAKER: I invite members to stand and observe a period of silence as a mark of respect for our late former Prime Minister.\n: Members stood as a mark of respect.\n: Waiata—\"Whakaaria Mai\"\n: The House adjourned at 3.30 p.m.",
        "tags": []
      }
    ],
    "conclusion": "Members stood as a mark of respect.",
    "tags": [],
    "content": [
      {
        "speaker": "",
        "text": "THURSDAY, 16 OCTOBER 2025",
        "type": "BeginningOfDay"
      },
      {
        "speaker": "",
        "text": "The Speaker took the Chair at 2 p.m.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "KARAKIA/PRAYERS",
        "type": "Debatealone",
        "isHeading": true
      },
      {
        "speaker": "SPEAKER",
        "text": "Almighty God, we give thanks for the blessings which have been bestowed on us. Laying aside all personal interests, we acknowledge the King and pray for guidance in our deliberations, that we may conduct the affairs of this House with wisdom, justice, mercy, and humility for the welfare and peace of New Zealand. Amen.",
        "type": "Speech",
        "timestamp": "time_20251016 14:00:41"
      },
      {
        "speaker": "",
        "text": "OBITUARIES",
        "type": "Debate",
        "isHeading": true
      },
      {
        "speaker": "",
        "text": "Rt Hon James Brendan (Jim) Bolger ONZ, PC",
        "type": "SubDebate",
        "isHeading": true
      },
      {
        "speaker": "SPEAKER",
        "text": "Members, I regret to inform the House of the death on 15 October 2025 of the former Prime Minister Rt Hon James Brendan (Jim) Bolger ONZ, PC. Jim Bolger was the member for King Country from 1972 to 1996, and then for Taranaki - King Country from 1996 to 1998. He was Prime Minister from 1990 to 1997.",
        "type": "Speech",
        "timestamp": "time_20251016 14:01:04"
      },
      {
        "speaker": "",
        "text": "ADJOURNMENT",
        "type": "Debatealone",
        "isHeading": true
      },
      {
        "speaker": "Rt Hon CHRISTOPHER LUXON (Prime Minister)",
        "text": "I move, That this House place on record its appreciation and gratitude for the devoted and distinguished service to New Zealand by the late Rt Hon James Brendan Bolger, Member of the Order of New Zealand, member of the Privy Council, member of this House representing King Country from 1972 to 1996 and then the renamed Taranaki-King Country electorate from 1996 to 1998, who served as Minister of Fisheries from 1977 to 1978, Minister of Immigration from 1978 to 1981, Minister of Labour from 1978 to 1984, Leader of the Opposition from 1986 to 1990, and as New Zealand's 35th Prime Minister from 2 November 1990 to 8 December 1997, and who later represented New Zealand as Ambassador to the United States from 1998 to 2002, and that this House express our sorrow and our sympathy to his wife Joan, their children and wider family, and that as a mark of respect, the House do now adjourn.",
        "type": "Speech",
        "timestamp": "time_20251016 14:01:33"
      },
      {
        "speaker": "",
        "text": "We remember today a devoted husband, father, and grandfather. Jim Bolger was a farmer from Taranaki, a proud New Zealander, but most of all, in the context of this House, we remember a former Prime Minister whose innate sense of fairness helped him make the right choices, at the right times, for the right reasons. In doing so, he helped New Zealanders become more confident in our nation's unique sense of identity.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Born in 1935 to a farming family in Ōpunake, Jim came to politics via what was then a very traditional training ground for National MPs, namely the Federated Farmers in provincial New Zealand. He joined the National Party and was elected the member King Country in 1972, a seat that he held until he left politics. Becoming leader of the National Party in 1986, the context for National's electoral success in 1990 was deep economic uncertainty and the unpopularity of the previous Government's economic reforms. Bolger's Government and the Labour Government that preceded it, ushered in a new era for New Zealand, creating the open, confident country that we are today.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "As Prime Minister, Jim led New Zealand through sweeping economic, social, and constitutional changes, from major fiscal reform, including the \"mother of all Budgets\", to industrial relations transformation, and to overseeing the early stages of Treaty settlements.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He was a strong supporter also of New Zealand's place in the world. He backed our alliance with the United States but respected the will of New Zealanders and maintained our nuclear-free stance. He strongly opposed nuclear testing in the Pacific and he helped reshape our foreign policy to be more outward-looking, more engaged with Asia Pacific, an approach that still guides our Government today.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The landmark Employment Contracts Act brought New Zealand's industrial relations into the modern era. As Jim said, \"Gone are all those stupid stoppages I had to deal with day after day. We used to keep the press gallery waiting outside in the cold while we resolved the dispute, then we had a beer, and then we told the journalist what the resolution was. It was important\", Jim said, \"to do things in the right order.\"",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He guided the country through the transition to MMP, a system he accepted as the will of New Zealanders.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "One of the defining moments of his premiership was the 1996 Heads of Agreement with Ngāi Tahu. There were doubts within the National caucus, the cost was high, the politics uncertain, and it was an election year, but Jim had an instinctive grasp of New Zealanders' innate sense of fairness. In his view, it was the right thing to do and he urged Cabinet to go ahead. That moment, and the Treaty settlement process it helped cement, stands as a proud legacy of his leadership.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He had a strong team around him, some of whom still serve in this House, and I've heard stories of long, late-night caucus meetings with a bit of arm twisting where needed, but also stories of loyalty, camaraderie, and deep respect. They didn't call him the \"Great Helmsman\" for nothing.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Jim never lost his humour or his humility, and in his valedictory, he opened by saying, \"I know there's some interest in what I'm going to say, but perhaps even more interest in how long I'm going to say it.\" He then thanked the Labour whip for the offer of another glass of water and said he was sure he would need it, and perhaps, as he went on, he might need something even stronger. That wit, along with his Irish charm and his fondness for a quiet evening's whiskey, remained part of his character throughout his life.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "After leaving Parliament, Jim continued to serve, notably as Ambassador to the United States. I wasn't in the room for those diplomatic conversations, but I have no doubt he made an impact, whether speaking with a Kiwi drawl or, as some suspected, adopting a touch of the American accent mid conversation.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I didn't have the privilege of knowing Jim well personally, but since becoming Prime Minister, I received a few quiet phone calls from him. They were short, sincere, and thoughtful. He offered encouragement, perspective, and advice—advice that I took seriously. I also remember campaigning with him in a bar in Waikanae and him still holding court in a room full of people, sharp as ever, fully engaged, loving politics, and very much enjoying himself. He'd just turned 87.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Not long ago, he celebrated his 90th birthday, surrounded by family, including eight of his nine children. He and Joan, who has stood steadfastly by his side since their marriage in 1963, were immensely proud, and rightly so.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "On behalf of the Government and the people of New Zealand, I extend our deepest condolences to Jim's wife Joan, his children and grandchildren, and all of those who knew and loved him.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "In closing, I want to use Jim's own words, written just a few weeks ago after the death of his friend Tā Tumu Te Heuheu. He said, \"He was, in simple terms, a very good person who was interested in helping others. Farewell, old friend, and may God welcome you home.\" Those words now speak for Jim himself. Thank you.",
        "type": "a"
      },
      {
        "speaker": "Rt Hon CHRIS HIPKINS (Leader of the Opposition)",
        "text": "",
        "type": "Speech",
        "timestamp": "time_20251016 14:07:37"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "The Labour Party joins with the Government in paying tribute to Jim Bolger, the 35th Prime Minister of New Zealand. I vividly remember the very first time I ever met Jim Bolger in person. I was in the sixth form at Hutt Valley Memorial College. Jim Bolger was the Prime Minister and New Zealand had just won the America's Cup. I was one of the lucky few students selected to come and be part of the official welcome reception for the victorious America's Cup team as they arrived home in New Zealand. While everyone else was rushing around the room, gathering the signatures of the victorious sailors, I was collecting the signatures of all the politicians—there were warning signs even back then!",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "But I met Jim Bolger and he was incredibly generous with his time. He took a genuine interest in younger New Zealanders. I think he asked more questions of me than I asked of him, and he was genuinely engaged and interested in the answers. He wanted to understand how New Zealanders saw what was happening in our country at the time and what we thought needed to happen in the future.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I wasn't hugely political at the time. I didn't really understand politics very much. That changed relatively quickly over the next couple of years as I went to university and found myself, a couple of years later, out the front of Parliament chanting some rather unsavoury things about Jim Bolger and his Government at that time. Not long after that, Jim Bolger quit Parliament. I'll claim all the credit!",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "But, actually, it was his quitting of Parliament where I got my first taste of election campaigning, because I quickly got involved in politics, ventured up to the King Country by-election, and went doorknocking in Hāwera. I can tell you, as an aspiring Labour Party activist, doorknocking in Hāwera is not a great place to start! We came third in the by-election, but I'm still here.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "But it was some years later when the gods of Air New Zealand ticketing seated Jim Bolger and I next to each other on a flight to Hamilton and then back again later on that day, that I actually had the opportunity to have quite a long conversation with him. He was flying to Hamilton to chair a University of Waikato Council meeting and I was flying up there to do some education-related visits.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I remember that it was late 2016 or early 2017, because the topic of conversation was dominated, at that point, by a certain US presidential election. He was deeply concerned about rising inequality, increasing polarisation, and the fact that so many people around the world seemed to have lost the ability to disagree with each other agreeably. We spent our time sitting together on the plane talking about that.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He could see that the concentration of wealth around the world was unsustainable, that the growing marginalisation of large segments of our society was leading to us becoming more divided, and that we could not continue to stand for that. He spoke, in his retired life, of the moral failure of prisons, and I totally agreed with what he was saying there.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I think perhaps growing up during the World War II and the long shadow of its aftermath meant that he was very, very aware and had a deep appreciation of the need for us all to constantly strive to find common ground and reconcile our differences. In the conversations that I had the privilege of having with him, we did manage to find a lot of common ground and I enjoyed all of the subsequent encounters that I had with him.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He would refer to me as young Chris even once I'd become Prime Minister, and he had a knack for offering his insights and wisdom without ever coming across as patronising or condescending. He did seem genuinely interested, not just in my political career, which he clearly had been following, but in the political careers of emerging politicians across the House. I think perhaps it's a wisdom that you get after you leave this place, that recognition that Governments come and Governments go, but the good interests of the country do rest with whomever the Government happens to be at any given time. He remained a mentor and a friend to anyone in this House who sought out his guidance.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "From the conversations that I had with him, though, I did get the sense that he struggled to reconcile his own values with the consequences of some of the things that happened during his time in politics, including during the time that he was Prime Minister. I've subsequently come to accept that that's a bit of a curse of all political leaders who happen to be in the hot seat during times of significant turmoil. It's perhaps the ones who don't wrestle with their conscience later on that we should worry about.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Jim Bolger's life is full of contradictions. His Government sold the Bank of New Zealand and then he was the inaugural chair of the new Government-owned Kiwibank. His Government ushered in the Employment Contracts Act and then subsequently he chaired a working group that led to the establishment of fair pay agreements. His Government did more to weaken unions than just about any other, but then in his later years he lamented how small unions had become and the effect that that had had for working people.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He sacked Winston Peters from his Cabinet and then formed New Zealand's first MMP coalition with Winston Peters as his Deputy Prime Minister, a Government that transpired to be remarkably stable, much to the frustration of the then Labour Party Opposition. I do want to acknowledge Winston Peters today, the only remaining member of the House who served in Government with Jim Bolger during the time that he was Prime Minister. I also acknowledge you too, Mr Speaker. Your first election victory was Jim Bolger's last election victory. I don't think we'll read too much into any of that.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "His passing marks the end of an era, but his impact on our nation and our politics will endure for many generations to come. His work to advance Māori and progress Treaty settlements does deserve special mention. I know how much he's held in high regard on marae and with iwi up and down the country. In one of his last interviews, only a couple of weeks ago, actually, ironically with a younger member of the Labour Party, he spoke of his concern that so many New Zealanders now seem scared of the word \"Māori\". He reminded us that when Māori do well, we will all do well. He also offered a sobering warning that until the injustices of the past are addressed and Māori are thriving, we will never be able to truly leave behind our past conflicts.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He grew up in Taranaki, was a farmer, and led as Prime Minister with pragmatism, often making tough decisions, but always with a clear vision of the country's future. He understood that the country is not just measured by its GDP or its trade figures but by the health and wellbeing of its people. He believed in Catholic social justice, and I know that his faith was important to him. He was a stoic, accepting that while no leader can ever choose their circumstances, they can choose how they respond to those circumstances. He had the serenity prayer hanging on the wall in his office. He was a staunch republican. He turned down a knighthood on leaving Parliament. He advocated for New Zealand to make its own way in the world. I think it's a huge tribute to him that he was nominated for New Zealand's highest honour, the Order of New Zealand, by a Government comprised of his former rivals.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Outside of his time as Prime Minister, he remained deeply involved in public life, always committed to improving the lives of ordinary New Zealanders. Humble, dedicated, passionate—his legacy is woven into the fabric of who we are as a country today.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I was reflecting that to some extent his passing bookends that of Mike Moore a few years back. Mike Moore was our last working class Prime Minister, leaving school with no higher qualifications. Jim Bolger remains our last true farming Prime Minister, also leaving with no higher qualifications. Both rose instead through their hard work, political nous, and deep understanding of the lives of ordinary New Zealanders, and their stories remind us that leadership is conferred not by degrees or by titles but through character, conviction, and service.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "To his family, particularly his wife Joan and his children, I offer my deepest condolences and to the many who knew him and worked alongside him and admired him, you can all take comfort from the fact that his influence continues to guide us and will continue to guide us in the years to come.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I thought it was fitting to end with an Irish Catholic proverb recognising his cultural heritage of which I know he was proud: \"May the road rise to meet you. May the wind always be at your back. May the sun shine warm upon your face, the rain fall soft upon your fields. And until we meet again, may God hold you in the palm of his hand.\" Nō reira, tēnā koutou, tēnā koutou, tēnā koutou katoa.",
        "type": "a"
      },
      {
        "speaker": "TEANAU TUIONO (Green)",
        "text": "Thank you, Mr Speaker.",
        "type": "Speech",
        "timestamp": "time_20251016 14:17:39"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "On behalf of the Greens, I rise to support the motion and to support the tributes to the Rt Hon Jim Bolger. In doing so, we understand that for the entire nation he was a Prime Minister, he was the great helmsman, he did many great things, but first and foremost he was a husband, he was a parent, and he was a grandparent. We would like to acknowledge that he had a big whānau and was a koro many times over. Our thoughts are with his wife, Joan, an Aotearoa community leader in her own right, who worked hard doing travel work and public speaking. We'd also like to send our aroha to his children:Dan, Paul, Brian, Stephen, Bernadette—tēnā koe e hoa—Fiona, Rachael, Matt, and Aidan, and his 18 grandchildren. He had a big whānau who will be hurting today, and I know that they will be missing their koro for many, many years to come.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "As I was scrolling through social media, I saw many tributes from many Māori communities—communities that he helped to support navigate the Treaty settlement claims. As I looked at the size of his whānau, I had to think that perhaps his deft ability in being able to work with many Māori communities was because he had his own iwi and he had his own hapū. It is on that understanding, I feel that many Māori felt that as well.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The Rt Hon Jim Bolger served as Aotearoa's Prime Minister between 1990 and 1997. He held several ministerial positions, being the first Minister of Fisheries, the Minister of Immigration, and the Minister of Labour. He was known for his intelligence and his strong debating and negotiating skills. He also wasn't afraid to work across political lines during Kiwibank and working on fair pay agreements, both under Labour-led Governments. The Hon Chris Hipkins did talk about a demonstration and protest outside that was protesting against his Government, and I think I was there—except I was one of those ones that wasn't collecting signatures from politicians at that particular time.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He oversaw some significant reforms, including the introduction of the MMP system—and acknowledging the Rt Hon Winston Peters from those times as well, and that Cabinet as well—the resource management, as well as the first major Treaty of Waitangi settlements in Tainui and Ngāi Tahu. I know that for those iwi in particular, he will be at the forefront of their minds.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He believed in Te Tiriti, historical justice, and a collective responsibility to honour our founding agreement. When people questioned him on why Treaty settlements, he responded by saying \"Because it is the right thing to do.\" I read that he reflected on his wife, Joan, who, attending school with children from Parihaka, and him attending Ōpunake School next door, never learnt the history about the land that they were on and what happened at Parihaka. He advocated for us as a country to learn our history and own it, warts and all.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I think there's an important lesson for all of us there, as political leaders, as well, because we know that there are ups and downs in this particular place, as well, but being able to navigate those different pressures and to come out the other side and, at times, reach out to the other side of the political divide to work on things like fair pay agreements shows the strength of the man. It also shows that, even in his later years, people who were his friends—and political enemies, may I say?—would continue to reach out to him for advice; this is a mark of a truly remarkable person.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I want to just leave us with this quote, which I was reflecting earlier on today. And that is this: \"We should teach our colonial history, because we don't, and this is a huge mistake. You cannot know who you are as a society unless you know your history. Look out across the world and see the extraordinary divisions within societies.\" There are some messages and some lessons from his tenure in this place but also the work that he did outside of Parliament.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "Hon DAVID SEYMOUR (Leader—ACT)",
        "text": "I rise on behalf of ACT to join other leaders in support of the Prime Minister's motion honouring and acknowledging the life and times and legacy of the Rt Hon Jim Bolger. As others have said, he was a man of a great family. Our thoughts are with Joan, his nine children, and his extended family, who, we all know as politicians, will have made great sacrifices in order for him to contribute to our country.",
        "type": "Speech",
        "timestamp": "time_20251016 14:22:54"
      },
      {
        "speaker": "",
        "text": "Many people will know the history very well—the changes that occurred in the 1990s, bedding in and continuing a process of economic reform that brought New Zealand into the modern world, and the reconciliation that occurred through the Treaty settlement process, without which, New Zealand today, would be unimaginable. And yet, it's so easy to forget how brave and difficult starting that process of Treaty settlements would have been in 1992.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He also presided over an enormous constitutional change where the way that New Zealanders elect their representatives to this House changed, and the structure of New Zealand politics changed with it forever. All of that history is well known. I, myself, am separated by two generations, as a person and as a politician, from Jim Bolger, so I don't have the richness of personal stories that others may be able to tell. However, this morning, on hearing the news, I consulted with some who had served and worked with Jim Bolger for their insights into what that was like and what sort of man and what sort of politician he was. They said to me things like: he was a person with a deep sense of the value of belonging; somebody who had a sense of fairness that could only be described as innate; somebody with a keen respect for the underdog; and somebody who felt a responsibility, not only to bring New Zealand into the future but also somebody who had a deep sense of responsibility to do the right thing. He was somebody who encapsulated many of the qualities of a politician that so many politicians themselves would like to be remembered for and so many people around the world, in so many different countries, would like to see in their leaders. That is an extraordinary legacy, one that we should all be very grateful and gracious to acknowledge in the House today.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Our finals thoughts are with those he has left behind. The entire Te Kūiti and King Country community, I know, will be feeling this deeply, as will his extended family and, particularly, Joan and his nine children today. Our thoughts are with them, and our gratitude is to him for the legacy that he has left the modern New Zealand. Thank you, Mr Speaker.",
        "type": "a"
      },
      {
        "speaker": "Rt Hon WINSTON PETERS (Minister of Foreign Affairs)",
        "text": "Today, our thoughts and condolences are rightly with Jim Bolger's family, his wife Joan, their many children, grandchildren, and the rest of his extended family. As a Catholic man of Irish extraction, he will have taken both solace and pride in being surrounded by his large family during his final moments. He could have asked for no better farewell.",
        "type": "Speech",
        "timestamp": "time_20251016 14:26:23"
      },
      {
        "speaker": "",
        "text": "As always, there are various views of history, but very few have had the benefit of living it, breathing it, and working on it like Jim. Therefore, it's right for this House to acknowledge Jim Bolger's passing. He was, ironically, a republican serving his King Country electorate for 26 years, from 1972 until 1998. As you know, he served as Prime Minister for seven years, leading three terms of Government, which were markedly different to each other in their complexion and their output.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Jim is acknowledged for his pride in New Zealand's independent national identity, and the presence of the national museum, Te Papa, here in Wellington is due in large part to his insistence that an institution that tells our history and engenders young and old to take an interest in their history was needed. Again, he was proud of his Irish ancestry and saw an historic parallel in the treatment of Irish nationalists with the mistakes of some former New Zealand Governments with Māori in New Zealand. As a Te Kūiti farmer, he grew up around Māori and saw no reason for difference and every reason for communities to be stronger together.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "It's often said that Jim Bolger was the last Prime Minister without a university degree. Well, for our sakes, we must hope that that is not true for the future. Jim learned his craft on the farm and in the town halls, and he applied it to the highest elected office in this country. In his earliest years in Parliament, he earned the title \"The Woolshed Orator.\" Jim Bolger was a man of good character, strong morals, and family values; he called for a decent society in 1990, and he did so for good cause. He was, in his own words, \"a red-blooded Irishman by descent, but a very practical Kiwi by practice.\"",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Now, we were not without our disagreements, but today is not for recalling those moments. Disagreements are, however, fundamental to the democratic project, and that was always understood by Jim. He happily took part in a healthy democratic discussion throughout his life, and, long out of politics, he later reminisced on the raging ideological disputes of his time as Prime Minister and had the reflective courage to admit that mistakes were made. It's true to say that, 29 years ago, in 1996, we formed the first MMP Government. We—he—put differences aside, shook hands on that agreement, and, more importantly, he kept his word.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Today, we can and must acknowledge that Jim Bolger contributed to a time of enormous difficulty economically and change to New Zealand. But, of far greater importance than this, we acknowledge the passing of a husband, father, and grandfather. Jim, may God bless you.",
        "type": "a"
      },
      {
        "speaker": "DEBBIE NGAREWA-PACKER (Co-Leader—Te",
        "text": "Pāti Māori):",
        "type": "Speech",
        "timestamp": "time_20251016 14:30:04"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "I rise on behalf of Te Pāti Māori to acknowledge the passing of the Rt Hon Jim Bolger. We have lost so many great pou this year.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Mr Bolger was a Roman Catholic, his politics informed by doctrines of peace, forgiveness, and reconciliation. He also lived near whenua beside Parihaka in Taranaki",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office].",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "His work around the Cabinet table gave life to the principles of good faith and goodwill unto all. We'll remember Mr Bolger's commitment to restoring the honour of the Crown under Te Tiriti o Waitangi. He knew Te Tiriti o Waitangi promises a place for all in this country, and that we all have love, and should have love, for each other. His leadership serves as a lesson: not to vilify or burn bridges with Māori communities but to embrace each other in the spirit of peace through justice, together owning our past and collaboratively looking towards our future.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Te Pāti Māori wishes to honour Mr Bolger in his Catholic tradition with this prayer.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "Mr Bolger knowingly expanded political capital for the nation's progress and to address historical injustices. His disposition is described by many who we also spoke to as magnificent, as inclusive, and as, indeed, a proud Irishman—earning him the nickname \"Spud\". For us, Mr Bolger is regarded as the greatest Prime Minister since Michael Savage. He had a legacy that affected the whole country. He heard and saw te iwi Māori.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Mr Bolger resisted pressure from what we understand was nicknamed the \"Rat Pack\". I won't name them, but names such as Bill English, Nick Smith, and others were included in it, and it was part of them pursuing neoliberal asset sales. The people who rang us today to make sure that we were sharing some of their stories were part of Government at the time, and the stories that they have to share talk about the actions and indeed—as a previous speaker said—ensured that he knew the art and the dignity and the respect of healthy debate, and when it was time to make sure that we could find a way forward no matter what your politics or parties were. The way that he was able to be a visionary and fight for things ensured that we actually have key national assets that we protect as part of national sovereignty, and that we collectively protect today.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Mr Bolger supported Doug Graham in signing historic Treaty settlements with Waikato-Tainui and Ngāi Tahu. Tukoroirangi Morgan rangatira said that Jim Bolger leaves a legacy in the Treaty settlement space that will remain unsurpassed. He modernised the whole process of reconciliation in an effort to bring Aotearoa and New Zealand closer together.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "In 1995, the people of Parihaka also were met and included by this wonderful man. He had the highest ideals of humanity. He acknowledged Parihaka and its peace and its justice, and that Tohu and Te Whiti were way ahead of their time. He also made comments that are embedded and will remain with Parihaka for as long as we are alive. He acknowledged that peace and justice in New Zealand should be honoured—that is the legacy of Te Tiriti. He remarked that we cannot build a nation on myths of equality that ignore our history, and history delayed must still be history delivered.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Te Pāti Māori offers its deepest condolences to the Bolger whānau. We also know that there will be many iwi and hapū who are saddened to hear of his passing.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "In his later years, Mr Bolger became an adviser and a close confidant of many iwi throughout the motu. Over the coming days, his name will be heard across a number of paepae, recognising his contribution to race relationships, and that ideal towards reconciliation are peace and justice.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "We will mourn his passing and remember his legacy with deep gratitude and affection. E te rangatira, moe mai rā.",
        "type": "a"
      },
      {
        "speaker": "Hon PAUL GOLDSMITH (Minister of Justice)",
        "text": "Thank you, Mr Speaker. I'll start by acknowledging the Bolger family at this time of loss. Our thoughts and prayers are with them. The word that comes to mind, in relation the former Prime Minister Jim Bolger, is \"decency\". He was a Minister, then Leader of the Opposition, then Prime Minister through some of the most tumultuous times in recent history—times of fierce antagonism—and he came through with most fair-minded people regarding him not as a divisive figure but, instead, as one who brought people together. He could build relationships with people who might have regarded him as the enemy. He was a man of faith.",
        "type": "Speech",
        "timestamp": "time_20251016 14:35:07"
      },
      {
        "speaker": "",
        "text": "Much has been covered of his career, but I would point out that his first election as Leader of the Opposition, in 1987, was a catastrophic loss, and yet he carried on. It was a different era; he wasn't cast out, and he went on to take the party to a stonking victory in 1990. He was a good manager of Cabinet, and he referred to his experience wrangling, with Joan, nine kids; being able to keep the peace; and move the family along. I think it was similar with the Cabinet; he had some salty characters. My first connection with him was during writing a biography of John Banks, who caused him no end of trouble over his time in Cabinet. I came across a quote from Banksie's diary, when he said, in caucus, \"Sometimes, Mr Bolger, I say things that must really piss you off (the caucus erupted).\" That's how he managed to hold the Cabinet and the caucus together.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The media and the country often gently—or not so gently—mocked him as \"Spud\". His plane was Spud One. \"The Great Helmsman\" has been talked about, the way that he said \"confident\" with a K, and the way that he adopted overseas accents when he was overseas. He was never super popular as Prime Minister, but he was respected, and that, in the end, is the most important thing.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "If we think of his legacies, his biggest, I think—well, a big one—was the contribution to the effort to restore the nation's finances during the 1990s. He'd been part of the Muldoon Cabinet that had resisted change and necessary reform up to 1984. Then, he had to deal with, as Leader of the Opposition, the reforming Labour Government that turned the political landscape upside down, where they almost lost Remuera in 1987. Then he had to confront the dire economic situation in 1990.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He didn't approach issues ideologically. He never set out to redesign the State, but he was a realist, and he confronted the scale of the challenge he inherited and faced the problem head on. He didn't flinch when it was not what he would have liked it to be, and pain was acute through 1991 and 1992. Progress was just sufficient for National to get re-elected in 1993, by a whisker. Remember he said, \"Bugger the pollsters.\", at the 1993 election, when they got back in by a whisker? But he led the country through strong period of growth in 1994 and 1995.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Another legacy was MMP, and some people will say that he broke a promise he should have kept with the superannuation and kept a promise he should have broken with MMP, and time and history will determine whether that was correct. He also failed in his efforts to make the nation a republic, but at least he tried. But more successful, of course, was his effort in starting Treaty settlements, particularly with Ngāi Tahu and Waikato-Tainui.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Jim Bolger, as said, grew up in a small town in Taranaki, in a predominantly Māori community, and was always comfortable amongst Māori. His instincts were fair-minded, and, with Doug Graham and his Cabinet, he set the nation on a process that, 30 years later, is still ongoing, and for which, we continue the work today.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Few countries have tried such a thing, to face historic events head on, to acknowledge, and apologise for past misdeeds. It's a process that requires much grace, particularly on the part of Māori, who received back a fraction of what was lost, but, also, to some extent, to the people of the current generation, who are setting aside resources that could be devoted to them right now to settle the sins of earlier generations. He and that generation of Māori leaders, in the 1990s, set us off on an important course, and he will always be remembered for that.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Unlike the US system, where presidents often end their second term at the height of their popularity, the New Zealand political system, like the UK system, generally ends with Prime Ministers ending in failure, living by the sword and dying by the sword and being tossed out. John Key, I suppose, would regard himself as the only exception to that. Jim Bolger fell to a coup, but after the dust settled, he no doubt understood that he had achieved a lot for the people of New Zealand.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He was \"The Great Helmsman\", and he took his turn at the wheel and steered through many squalls confidently and competently, and we wish his family all the very best.",
        "type": "a"
      },
      {
        "speaker": "Hon Dr MEGAN WOODS (Labour—Wigram)",
        "text": "Tēnā koutou e te Whare. E Jim, moe mai, moe mai, moe mai rā [Rest in peace, Jim]. I rise with the rest of the House to acknowledge the life and the legacy of the Rt Hon Jim Bolger, and to extend my deepest sympathy to Joan and the Bolger family. Losing someone is never easy, regardless of their age or their health. Today, we honour a man whose contributions to Aotearoa New Zealand were both significant and enduring, and I would like to acknowledge his colleagues and those who have worked with him over the years.",
        "type": "Speech",
        "timestamp": "time_20251016 14:40:33"
      },
      {
        "speaker": "",
        "text": "Jim Bolger was a leader who, it has been writ, confounded expectations. He once remarked that his life was full of ironies, a reflection on his journey from privatising rail in the 1990s to later chairing its renationalised successor; and, as Chris Hipkins had said, from selling the Bank of New Zealand to later chairing Kiwibank. These ironies were, however, not contradictions but evidence of a man who evolved, a man who listened, a man who acknowledged change in his thinking, acknowledged his mistakes, who was open to new thinking, and a man who led with conviction. In an increasingly politicised and polarised world, Jim Bolger's life reminds us that it is possible to work constructively and respectively across political divides. We do not need to agree on everything to find common ground—and this was one of his great strengths.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Jim Bolger challenged and confounded me at two pivotal stages of my life. Firstly, as a student at the University of Canterbury in the early 1990s, I held very strong views about the policies of his Government. The \"Mother of all Budgets\", welfare cuts, and the Employment Contracts Act 1991 were deeply at odds with my values. However, it was a lecturer in the history department—a lecturer in New Zealand history who I greatly admired and respected and still do—Tā Tipene O'Regan, that presented a different view of Jim Bolger. In Tā Tipene's Treaty history honours class in 1995, right in the thick of the Ngāi Tahu claim negotiations, I was presented with a view of a Prime Minister with a deep understanding of our history who was prepared to listen and genuinely wanted to address the wrongs of the Crown - Māori relationship. Tā Tipene spoke to us of a man who did what he believed was right, even when it meant standing up to his own team.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Years later, as a new Minister, I began regular meetings with Jim in his role as the chair of the Gas Industry Company. These continued throughout our six years in Government, and I always looked forward to these meetings every 12 weeks. His wit, his warmth, his humour, his inquiring mind, and his willingness to engage in robust, respectful dialogue were qualities that I deeply admired. We didn't always agree, it's fair to say, but that was never a problem. What mattered was our constructive relationship, that was built and grounded in mutual respect and a shared commitment to public service. Jim understood, perhaps better than most, the challenges of being a Minister and governing. He was always genuine in that desire to be helpful, and I valued his insights immensely. I also appreciated his fondness for lingering a little longer after meetings, telling his chief executive that this was the \"any-other-business\" section of the agenda and he wanted to indulge in a bit of political gossip.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "As the member for Wigram, it would be remiss of me not to acknowledge Jim Bolger's role in chairing Kiwibank: a lasting legacy of my friend and predecessor Jim Anderton and a testament to both of those men's belief in a strong, proud, and independent New Zealand. Jim Bolger was a gentleman of New Zealand politics. He led, he listened, he evolved, and he served. Today, we honour his life and his legacy and the example he sent to us all. Thank you, Jim, and may eternal rest grant upon you.",
        "type": "a"
      },
      {
        "speaker": "TĀKUTA FERRIS (Te",
        "text": "Pāti Māori—Te Tai Tonga):",
        "type": "Speech",
        "timestamp": "time_20251016 14:45:21"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "Hon TAMA POTAKA (Minister for Māori Crown Relations: Te",
        "text": "Arawhiti):",
        "type": "Speech",
        "timestamp": "time_20251016 14:50:34"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "When we talk about leadership we often look to the Beehive, to the House, or to the halls of power, but, for Jim Bolger, leadership began in a far simpler and humbler place, at Te Namu, often referred to as Ōpunake—the home of many legends, particularly Wiremu Matakātea, Peter Snell, and my mother. Places around there like Oaonui and Ōeo, Hukunui Manaia—named after Hukunui Manaia—and others, in the grandiose \"Surf Highway 45\". Some people, like our hat-wearing friend Rawiri, talk about State Highway 35, but Debbie and me, we're \"Surf Highway 45\". That's where Jim Bolger was from. Those small coastal towns where he was brought up, Ōpunake and Rahotu, beneath the gaze of Taranaki maunga shaped a man who would go on to lead a nation, a man of respect, a man of responsibility, a man of redistribution, a man of relationships, a man of reciprocity, and a man of mana. It's also a town and a village, Rahotu—just down the road from Parihaka, the location of some of the Crown's most egregious and vicious behaviours against our people in Taranaki—the suspension of habeas corpus and various other measures that symbolise the rule of law. This is rich symbolism given the achievements and the attainments of Jim's contributions in public life, and, today, I celebrate his conviction, and I celebrate his devout determination to serve in the interests of all New Zealanders and to go forward together.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Jim told me that he was nominated for the National Party candidacy in the King Country in 1972. He was very late for his nomination, and he was one of six—one of whom was my wife's grandfather, Brian Jones, the son of Pei Te Hurinui. He won that nomination and went on to serve. His maiden speech, of course, spoke of the great reassessment facing the world in recognition that progress must serve people, not just economics. He saw beyond that partisanship, calling for balance between growth and human wellbeing. Of course, that same clarity would define his approach to Te Tiriti o Waitangi, the Treaty of Waitangi. When he came into his great responsibilities, Māori issues were often seen as marginal debates rather than central to the nation's wellbeing. I acknowledge the references, the other evening, in relation to both the te reo Māori petition and also the great hīkoi led by Dame Whina Cooper, and might I also mention the Takaparawhau reimagination that lasted over 500 days.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The Waitangi Tribunal's power to hear historical and herstorical grievances was still new when he came into responsibility, and the country was still learning to listen. His approach, alongside people like Bill Birch, like Doug Graham, and, of course, Minister Peters and the Speaker, who were in service of the communities in the country that we serve, in the 1990s. The settlements have been mentioned, but also, beyond the settlements, he observed that those moments in history are not just about winners and losers; they're about reconciling our history and our herstory so that the people of this great country can move forward together with confidence, with determination, with dignity, and with clarity. It's not just signing a document or signing an agreement in principle or deed of settlement and drawing a line under our story; it's also about opening the future possibilities, whether or not that was in his service in Te Urewera with the Te Urewera board, that groundbreaking legislation that enabled Te Urewera to have its own legal identity and personality, but also in the reconciliation redress provided to Parihaka in 2017 and his mahi, alongside Dame Tariana Turia—e mihi ana ki a ia—over there in the west coast.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Jim said, \"You cannot build a future on injustice. If you want peace and reconciliation, you must acknowledge the truth.\" Those words are not simply for his time but resonate today. He presided over the recognition of Te Wānanga o Raukawa and Te Wānanga o Aotearoa as wānanga under the relevant education legislation. He also presided at a time when Māori broadcasting emerged. He did not posture. He listened to diverse voices and made space. You saw the transition to MMP, as has been mentioned today, that has ushered in an era of our parliamentary story where there are more Māori MPs than ever before.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He wasn't a radical. I remember meeting Jim Bolger for the first time when I was 8 years old in the Raetihi school hall, and my father and I and others had to perform a Ngāti Toa Rangatira ngeri for Jim on his arrival at that time. From what I recall, it was actually the night of the 1984 election—not a fantastic night for the National Party, but a great night to meet Jim Bolger. He wasn't a radical, but, indeed, his leadership and his legacy have enabled a radical transformation of our country, in my humble opinion, for the better. The strength of our nation—as witnessed and heard on his recent conversations with the Hon Nanaia Mahuta on YouTube, if you want to check that out—doesn't just come from the 120 or so of us that sit in this House, in this debating chamber, but from families and whānau, from communities, groups, and organisations, from workers, from business people, and from the different threads that go through that needle.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "There is but one eye of the needle through which these threads must all go. He understood that Māori prosperity and the health and wealth of Māori would lift national prosperity and New Zealand prosperity, and that social obligation, economic growth, and spiritual connection are not enemies. They are partners. They live together. These actions demonstrate his commitment to the country, his values and, what I particularly reflect on, respect for whakapapa, for our land and moana, for people, responsibility to act fairly, to deliver on promises, to hold ourselves to account, and also for kotahitanga, where our development, our nation's development, whānau wellbeing, conservation, and economics are not traded off too far against one another—pitted off against one another—but are combined together.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He lived, in words of our colleague the Hon Megan Woods, with conviction that progress does not require us to abandon our roots but to affirm and to grow them. As Minister for Māori Crown Relations, Māori Development, Conservation, and Whānau Ora, I carry those challenges and those messages closely—to treat the Treaty not as a relic, but as a living foundation to address the needs of our people and not to just sit in ideology but to drive for outcomes together. We won't build peace by ignoring our past wrongs, or build kotahitanga by amplifying or continuing our divisions, but we build, according to Jim, by facing them, by listening, and by honouring our obligations to one another.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "My grandfather Ivan Len James worked on the farm of Jim Bolger's father and mother at the back of Rahotu—I won't get into the translation of that word, but maybe the translator can translate for you. He reminded me that Jim was someone who was of the land, for the land, and for the people. Tēnā koutou katoa.",
        "type": "a"
      },
      {
        "speaker": "Hon WILLIE JACKSON (Labour)",
        "text": "Kia ora, Mr Speaker. It's an honour to pay a tribute to Jim Bolger. It's been all so wonderful listening to all the kōrero today, but one of the things that I think that's been missed in the kōrero, with respect, is that Jim Bolger, I felt, had an incredible wit.",
        "type": "Speech",
        "timestamp": "time_20251016 14:59:58"
      },
      {
        "speaker": "",
        "text": "As you know, Mr Speaker, he had great, great humour. The last time I saw him—and I always liked to go up to him and have a bit of a chat—I said to him, \"You know when we were in the union movement, Jim, we hated you with a vengeance—you know, like we hated your guts.\" He said to me, \"Willie, tell me something new—tell me something new, I've heard it all before.\", and I said, \"Oh, OK. Well, I've got something new for you there, Jim. When we were in the union movement, a number of us younger guys had all sworn that if we saw you on the street, we'd punch you right between the eyes. It was either you or Muldoon.\" He laughed his head off. He said, \"Is that your Māori or Pākehā side coming out?\" I said, \"Definitely Pākehā side!\"",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "So I remember him with all this wit, and people talk about him being such a contradiction—I mean, he destroyed us at union level. You know the Employment Contracts Act. There was a time, as you well remember, Mr Speaker, that when you joined a job, you joined the union. You know, there was no option in those days. I loved those days—bring back those days, I say.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I was a young, militant union official, and this bloke Bolger turned up and he was the Minister of Labour. Oh man, and in those days, if you thought we had the hīkoi march—that was huge, as we all know—there were marches to rival those hīkoi marches. Bill Andersen, Ken Douglas—this was the union movement at the time. We all swore that we'd get to Bolger, but we were all unsuccessful, as you well know. I just thought, \"One day, if I ever catch up with this Mr Bolger\", and one day, I did. It was in a Jim Anderton - Labour Government, and old Jim, for some reason, he'd had a sort of a turn-around. He became our chairman of Kiwibank. Later on—I mean, we're talking about someone who oversaw the fair pay review—I said to him, \"I didn't think you were the same bloke.\", and he goes, \"I was always the same bloke. You know, I'm Jim from Te Kūiti, where your mother was born, Willie Jackson—where your mother was born.\"",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "So those sort of reminders and his sort of style, it just really showed you that someone could cross over, and he is a person who crossed over, as we've heard today. I want to say to everyone, it's great when we hear this type of kōrero because, in my view, Jim—and I've heard particularly from Te Pāti Māori, I love some of that kōrero coming out—you're talking about the most significant and influential National leader of the last two generations with regards to Māori and race relations.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I want to mihi to him in his whānau today: to his beautiful wife Joan and to his daughter Bernadette, who worked with us when we were Ministers. A wonderful, wonderful family, and, as he said, \"It's the Irish and the Māoris, Willie. There's a connection there.\", and I have to agree.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "But it was a fascinating life—and what a life. Who would have believed that someone who left school at 15 years old, with no qualifications, goes on to become the Prime Minister and the Leader of the National Party? You know, we want more of those sort of people in the National Party. We're hoping—myself and now Chippy, our leader over here—that one day that will happen.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "It is such an opportunity today to mihi to him and his whānau and to his contribution, because his commitment in terms of te ao Māori has to be remembered. His courage has to be saluted. I think all the speakers have done that today—all the speakers have done that today. It was courage, and I heard \"Goldie\"—or Minister Goldsmith, I should say—talking about it. It was not an easy time back in 1995-96 to actually bring the Treaty settlements together. We can sort of kid ourselves and say that \"Oh well, everything's wonderful now. Tipene's got $2 billion in terms of Ngāi Tahu, and Tainui is flying.\", but Māoridom were protesting in 1995-96, like you would not believe.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "My uncles Sid and Moana Jackson were leading a lot of that protest in terms of what the Government was doing. But the Prime Minister held to the principle that justice had to be redressed, had to be settled, and although 2 percent of a settlement or of a loss didn't really go to where it should have done, because for—and I heard Megan Woods talking about Ngaī Tahu. the Ngāi Tahu settlement was worth $16 billion to $18 billion. That's what the economists told us, and they settled for $170 million. They settled because of the leadership and innovativeness of Tipene. They settled also because of the strength of Jim Bolger and Doug Graham and a National Government who, I think, and who Māori believe, should be remembered and should be saluted—and that's a lot coming from me, Mr Speaker, I tell you.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "But we remember that time well. We remember that time well and although there was protests and although the settlements were not where they should have been, we had a Prime Minister who was fixed on justice, who was fixed on redress, who was fixed on Māori getting the acknowledgement they deserved because he believed that if Māori were strong, then this country would be strong. And I salute him. I salute his courage, his whānau, his people.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "[Authorised reo Māori text to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "[Authorised translation to be inserted by the Hansard Office.]",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "BARBARA KURIGER (National—Taranaki-King Country)",
        "text": "Thank you, Mr Speaker. It's a privilege to stand in the House today and speak, as the current Taranaki-King Country MP, on the death of James Brendan Bolger. It's been a very sad and difficult week for the King Country. The heavens have opened this week. There have been five roads, at least, closed and devastation in our community. One can't but help whether this is significant, followed by the death of our previous member of Parliament and Prime Minister.",
        "type": "Speech",
        "timestamp": "time_20251016 15:07:10"
      },
      {
        "speaker": "",
        "text": "For those who have walked through the street of Te Kūiti in recent years, you may have seen the legends gallery on Rora St. The legends gallery is testament to six legends. We call Te Kūiti the town of legends. It's also the shearing capital of the world, Mike Butterick! We have six people who we really hold in high esteem: Dame Rangimārie Hetet; Les Munro, the Dambuster; Jim Bolger; Koro Wētere; Colin Meads; and our one living legend who is still alive, David Fagan. Those are our local legends in Te Kūiti.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "There's a history with the Taranaki-King Country electorate. Jim Bolger was elected to Parliament in 1972, as you have heard today—that was my last year in primary school. There has been one member of Parliament between Jim Bolger and myself, and that was Shane Ardern. So, for 53 years, the King Country has been represented by the three of us in various formats before and since MMP. The one significant thing that may not have come to most people's attention is that we all went to Opunake High School, all three of us. It's probably a coincidence, but something very special that we share and something that the school is very proud of.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The other thing was that Jim Bolger and I were both members of Rahotu Young Farmers at different times. We were in debating teams, obviously at different times, but he was a great mentor to the young farmers who came along post his time.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "All of his life, he has been a contributor to society. I can remember as a young married couple with our young family, we hosted a potluck dinner with the Prime Minister the Rt Hon Jim Bolger at our house in Ōaonui. That was when the Taranaki-King Country electorate came all the way round to where David MacLeod's  current electorate is. So that was a significant event, and little did I know that, a few years later, he would be one of my predecessors as I then stood for Parliament.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "What is also little known is that my husband, Louis, has an auntie Anna who is married to Paddy Bolger, who is Jim Bolger's brother. So, in a way, Jim is whānau.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "It was a great pleasure when I first came into Parliament, for Jim's 80th birthday. My EA Samantha at the time—Samantha Laming—was a great cakebaker, so we asked her to make a cake for the Rt Hon Jim Bolger for his 80th birthday. She was very nervous, as you can imagine, for a young EA. So I rang Auntie Anna, and I said, \"We're going to decorate a cake for Jim. How should we decorate it?\" She said, \"I think there are two options: one, you can either make it in an Irish theme; or the other theme I would give you is 'don't fence me in.' \" We ended up making it in the shape of a leprechaun hat and made it very Irish. To Samantha's credit, it was great. We took it up to the 19th floor of Bowen House, to Chris Finlayson's office, and we had coffee and cake. It was a wonderful occasion.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "So it's been a pleasure to be in the electorate. Jim is held in high esteem. I had his desk for quite some time, and we did ask him if he wanted it back. It is now with Ko Wai Au, which is a whānau community support group, a non-profit community organisation, which is very fitting.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "It's really interesting: somebody sent me this little box a few years ago, and it was presented to the Rt Hon James B. Bolger, Prime Minister, on the occasion of the launch of the Hellenic New Zealand Congress, Parliament Buildings, 2 September 1995. They said, \"Can you find a way to get this back to Jim Bolger?\" And I said, \"Yes.\" So I picked up the phone and I gave him a call. I always appreciated his phone calls and I knew I could pick up the phone and call him when I needed to, too. I rang him and he said, \"Barbara, I think I have enough things at my house. I don't think I need to collect any more things.\" He said, \"You can hold this and you can look after this for me.\"",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "So he's obviously a very well-respected man. I will say in the comments today from Debbie Ngarewa-Packer and Tākuta Ferris, I went to Opunake High School, as I mentioned, a number of years after Jim Bolger, and we didn't know much about Parihaka when I went to school, either. So it was a sad history and I'm really glad that people like Jim Bolger has been able to contribute to where we have got to today, and may we continue in his legacy.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The last thing I just want to do is to wish the very best, and pass on my regards, to his wife, Joan, and his family. All his family are contributors. When Jim left Parliament, he didn't stop contributing; he was contributing right to the point where he just couldn't contribute any more.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "So rest in peace, Jim Bolger. You can be sure you will remain a legend in the King Country, and we will never forget you. Thank you.",
        "type": "a"
      },
      {
        "speaker": "TIM COSTLEY (National—Ōtaki)",
        "text": "I'm going to miss \"Sir Jim\", and I know he wasn't a fan of knighthoods, but when we met, I told him he'd been Prime Minister for seven years and I was going to call him \"Sir\". We compromised on once a day, and so that's my one done.",
        "type": "Speech",
        "timestamp": "time_20251016 15:14:40"
      },
      {
        "speaker": "",
        "text": "Jim grew up on the farm in Taranaki, just down the road from my mum's family, and I first met him, actually, at my gran's funeral. He'd been a bit busy during my teenage years running the country, but I remember thinking it was pretty cool that the just recently retired Prime Minister would turn up to my gran's funeral.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "But the thing I learnt about him, and Joan, to be fair, is that they always took the time. If Mum or Uncle Brian were in town, they'd take the time. If I was calling in to visit but I had the kids, it was never a problem. They would take the time for a cup of tea or, if it was after 3, maybe a glass of red wine, or there might be a loan of the trailer to take the green waste to the tip. In fact, when I was overseas with the air force for a few months, he got in touch, suggesting that maybe he should go around and take all my green waste to the tip for me. I said that there was no way I was having a former Prime Minister turn up and take my green waste to the tip, and I got home and saw how much there was and regretted that.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "But he was always making time for others, whether it was local events or both of my election nights. In fact, in the last election, he had sent me a message saying that look, he had all the family around and he wouldn't make it to our function. But Joan tells the story that an hour in, as the results were coming in, he stood up and announced, \"Right, we're off.\", and they came down and joined us at the Waikanae Bowling Club—very fond memories.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "They were always making time for others. He was still active right up until the end, helping our council, helping community groups, helping the local Catholic church, and still enjoying frequent visits from the media—I'm not sure we always enjoyed them, but he certainly did.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "My good friend Chris Bishop was reminding us this morning that when he and Nicola came to run a public meeting with me just a few years ago, after they had finished speaking, there were the usual questions and answers. Maybe five minutes into the questions, Jim came to the front and gave what, with all due respect, now reminds me of committee of the whole House speeches because it wasn't really a question. There was no question mark at the end of it and it went on for quite a while. But, eventually, the questions did start; it was just that they were from the floor, and not for Chris or Nicola. They were for Jim, and he was away.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Do you know, I think most residents on the coast have been to a business breakfast or a public meeting that's been hosted by Jim. A lot of the time he hadn't been invited to host them, but inevitably that's where things ended up. I think for people—and maybe my electorate has a slightly older average age than many, but I think they just shut their eyes and it took them back to the 1990s and, while we joke about it, I think they felt safe. I saw how deeply respected he was and how deeply loved.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "There are many who will feel this loss far more keenly than I will. I think of Joan—perhaps his greatest accomplishment in his 90-plus years. They were an amazing couple. In fact, when they found out one night that Emma, my wife, couldn't come with me to a National Party function—no, they were sending around the Bolger grandchildren to babysit, and from there on in, we were never short of babysitters. I'm not sure Emma appreciated losing the excuse to not turn up as much as Jim and Joan intended, but they always made the time, and do you know what? He was still blue to the core. Sometimes you had to scratch a little further—as we've heard—in his later years, but he was blue to the core right until the end.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The phone rang late on a Saturday night just a couple of weeks ago, and I said to Emma, \"I'm not answering it. It's way too late.\" Then I saw whose name was on it—\"OK, I'm answering it.\" Jim always took the time for me, with the regular text messages and phone calls. I would get a summons round to the house if we hadn't caught up for a couple of weeks and we'd chat about the issues of the day, and I'd listen to many stories from his time at the top, as well.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Actually, they were often stories from his time as a Minister under Muldoon. He'd talk about being sent overseas for six weeks with almost no accountability. \"It was fantastic.\", he said, and that's when he got to meet the then Vice President George Bush Senior. But it was experiences like that that set him up for the first few years of his time as Prime Minister—he talked about being one of the only small country leaders that had a direct line into the White House—and, of course, for his time as our Ambassador to the US, as well.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Perhaps the story I remember the most leads me back to where I started, back in Taranaki. He talked about in 1996, I think it was, when people came to him and said, \"What are we calling Mount Taranaki?\", or, as it was then, Mount Egmont. \"You have to decide, Prime Minister. What's it going to be? Are we going to change from Egmont to Taranaki?\", and Jim in, I think, his deep wisdom said, \"Just let people decide. If they want to call it Egmont, call it Egmont. If they want to call it Taranaki, call it Taranaki.\", but he could see the culture shift that was happening.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "There was not just that deep wisdom but that strategic patience in that, and I think it has been proven right three decades later. Jim knew that people needed time to adjust and that you can't force instant intergenerational change on people—it doesn't work. Big changes are made one step at a time, and they are far more effective if everyone takes one step together, rather than just a few taking many.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The challenges we face today are different, but they're actually kind of just the same. As he said, \"You don't win the battle to lose the war. You can avoid the battle and we can win the war together.\", and I think Jim won many times over. He won for Māori, he won for farmers, he won for a nuclear-free Pacific, he won for the man and woman on the street—whom he understood so well—and he won for Kiwis.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He was a leader. He was a leader that preferred to make the right decision over the popular one, and who was willing to wait for the best outcome and not rush into the wrong one, and I think that as a result, maybe he's one of our more underrated leaders but also one of our more respected ones, both because of his values and because of the values that we all hold as a nation. Perhaps there's a lesson in that for all of us.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He taught me that when we enter this esteemed House, we need to move from protester to parliamentarian, and that to be a true statesman and a leader takes patience as well as persistence. It takes grace and gravitas; conviction and compromise. It's not just about tearing down people in this House, but building up all of those who live outside of it.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "So when I look at Mount Taranaki, I remember that Jim showed us a high road. It may be a little longer, it may be a little windier, and it may be a little bumpier at times, but it has room for us all to journey together. Perhaps in this moment—even just for a moment—we can take one step along that road together towards the future that Jim wanted for his family and for ours.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "To finish, I say to Jim's family in this sacred moment that we think not just of his contribution to country but his commitment to family, right back to when you were all squeezed into that station wagon on those long drives home. We send our love to all of you, and there really are a lot of you, but we send you our love as we mourn your granddad, your father, and your husband. Rest in peace, Jim.",
        "type": "a"
      },
      {
        "speaker": "SPEAKER",
        "text": "I want to thank the House for those very fine tributes to the great New Zealander, and, if the House will indulge, make a few comments of my own.",
        "type": "Speech",
        "timestamp": "time_20251016 15:23:32"
      },
      {
        "speaker": "",
        "text": "I first met Jim Bolger in 1987, and through the subsequent years, saw him at many party functions and was a great admirer of his. He came to a campaign function for me in 1996. Perhaps demonstrating the sort of gentle Irish charm that he had and the warmth that he exerted, when meeting my mother, who was only 5 foot 3 and a very, very petite woman, he looked at her and said, \"How on earth did you end up with a brute like that?\"",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "He was, in his time, a great parliamentarian. He offered a lot of advice to young members when they came in here; we were only with him for a couple of years, I have to say. But one of the things he said is that yesterday doesn't have to be today, and so many of the tributes today, I think, have indicated exactly how much that thought process was guiding him over that period of time.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I do want to thank everyone for mentioning Mrs Bolger. She was his rock for such a long period of time, and he delighted in telling people the story of how they met. I won't go into that—that's for someone else. But what I can say is that when I heard that story a number of times, the joy in his eyes was no less for each time that he told that story, and I think that wonderful partnership is something that the whole country should celebrate. I do offer condolences to Joan and to the family for what they'll be feeling at this time.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I think I have to say, too, that Jim Bolger loved convivial situations. He loved gatherings of people. He enjoyed, as any true Irishman would, the opportunity to be with other people.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I recall that shortly after the formation of the 1996 Government, Doug Kidd invited a number of senior Ministers and members to the Speaker's Lounge for ongoing discussions, which you can imagine involved a lot of, you know—well, basically they loved their whisky. Doug pointed at me and said, \"You come too.\", and so I did, but I found out I was only there to be the waiter.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "I was quickly dispatched by Jim Bolger to go and find Ian Revell, who played a guitar. He said, \"Get Revell, get his guitar, get him back here. We're going to sing some songs.\" He loved singing—and it's interesting you mentioned that song, Barbara. He did a three-chord version of \"Don't Fence Me In\"—something that I'll never forget—and then a number of Irish songs.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "But then he dragged everybody out on to the balcony just outside the Speaker's Lounge, drinks in hand, some smoke ascending above their heads, and then he led the group in a resounding rendition of \"Danny Boy\", and you just think to yourself, could a Prime Minister do that today? I'm talking about the whisky, Chris!",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "The reality is that he was able to be himself with those who he worked with. Too often, I think, we have to hide that away because of the malicious nature of social media these days.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "So we have lost a great New Zealander—no question about that. He was a man of deep Catholic faith. May perpetual light shine upon him. Rest in peace, good and faithful servant.",
        "type": "a"
      },
      {
        "speaker": "",
        "text": "Motion agreed to.",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "SPEAKER",
        "text": "I invite members to stand and observe a period of silence as a mark of respect for our late former Prime Minister.",
        "type": "Speech",
        "timestamp": "time_20251016 15:27:38"
      },
      {
        "speaker": "",
        "text": "Members stood as a mark of respect.",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "Waiata—\"Whakaaria Mai\"",
        "type": "IndentMarginalone"
      },
      {
        "speaker": "",
        "text": "The House adjourned at 3.30 p.m.",
        "type": "CentredEndingBold"
      }
    ],
    "fullContent": "THURSDAY, 16 OCTOBER 2025The Speaker took the Chair at 2 p.m.KARAKIA/PRAYERSSPEAKER: Almighty God, we give thanks for the blessings which have been bestowed on us. Laying aside all personal interests, we acknowledge the King and pray for guidance in our deliberations, that we may conduct the affairs of this House with wisdom, justice, mercy, and humility for the welfare and peace of New Zealand. Amen.\n\nOBITUARIESRt Hon James Brendan (Jim) Bolger ONZ, PCSPEAKER: Members, I regret to inform the House of the death on 15 October 2025 of the former Prime Minister Rt Hon James Brendan (Jim) Bolger ONZ, PC. Jim Bolger was the member for King Country from 1972 to 1996, and then for Taranaki - King Country from 1996 to 1998. He was Prime Minister from 1990 to 1997.\n\nADJOURNMENTRt Hon CHRISTOPHER LUXON (Prime Minister): I move, That this House place on record its appreciation and gratitude for the devoted and distinguished service to New Zealand by the late Rt Hon James Brendan Bolger, Member of the Order of New Zealand, member of the Privy Council, member of this House representing King Country from 1972 to 1996 and then the renamed Taranaki-King Country electorate from 1996 to 1998, who served as Minister of Fisheries from 1977 to 1978, Minister of Immigration from 1978 to 1981, Minister of Labour from 1978 to 1984, Leader of the Opposition from 1986 to 1990, and as New Zealand's 35th Prime Minister from 2 November 1990 to 8 December 1997, and who later represented New Zealand as Ambassador to the United States from 1998 to 2002, and that this House express our sorrow and our sympathy to his wife Joan, their children and wider family, and that as a mark of respect, the House do now adjourn. We remember today a devoted husband, father, and grandfather. Jim Bolger was a farmer from Taranaki, a proud New Zealander, but most of all, in the context of this House, we remember a former Prime Minister whose innate sense of fairness helped him make the right choices, at the right times, for the right reasons. In doing so, he helped New Zealanders become more confident in our nation's unique sense of identity. Born in 1935 to a farming family in Ōpunake, Jim came to politics via what was then a very traditional training ground for National MPs, namely the Federated Farmers in provincial New Zealand. He joined the National Party and was elected the member King Country in 1972, a seat that he held until he left politics. Becoming leader of the National Party in 1986, the context for National's electoral success in 1990 was deep economic uncertainty and the unpopularity of the previous Government's economic reforms. Bolger's Government and the Labour Government that preceded it, ushered in a new era for New Zealand, creating the open, confident country that we are today.As Prime Minister, Jim led New Zealand through sweeping economic, social, and constitutional changes, from major fiscal reform, including the \"mother of all Budgets\", to industrial relations transformation, and to overseeing the early stages of Treaty settlements.He was a strong supporter also of New Zealand's place in the world. He backed our alliance with the United States but respected the will of New Zealanders and maintained our nuclear-free stance. He strongly opposed nuclear testing in the Pacific and he helped reshape our foreign policy to be more outward-looking, more engaged with Asia Pacific, an approach that still guides our Government today.The landmark Employment Contracts Act brought New Zealand's industrial relations into the modern era. As Jim said, \"Gone are all those stupid stoppages I had to deal with day after day. We used to keep the press gallery waiting outside in the cold while we resolved the dispute, then we had a beer, and then we told the journalist what the resolution was. It was important\", Jim said, \"to do things in the right order.\"He guided the country through the transition to MMP, a system he accepted as the will of New Zealanders. One of the defining moments of his premiership was the 1996 Heads of Agreement with Ngāi Tahu. There were doubts within the National caucus, the cost was high, the politics uncertain, and it was an election year, but Jim had an instinctive grasp of New Zealanders' innate sense of fairness. In his view, it was the right thing to do and he urged Cabinet to go ahead. That moment, and the Treaty settlement process it helped cement, stands as a proud legacy of his leadership.He had a strong team around him, some of whom still serve in this House, and I've heard stories of long, late-night caucus meetings with a bit of arm twisting where needed, but also stories of loyalty, camaraderie, and deep respect. They didn't call him the \"Great Helmsman\" for nothing.Jim never lost his humour or his humility, and in his valedictory, he opened by saying, \"I know there's some interest in what I'm going to say, but perhaps even more interest in how long I'm going to say it.\" He then thanked the Labour whip for the offer of another glass of water and said he was sure he would need it, and perhaps, as he went on, he might need something even stronger. That wit, along with his Irish charm and his fondness for a quiet evening's whiskey, remained part of his character throughout his life.After leaving Parliament, Jim continued to serve, notably as Ambassador to the United States. I wasn't in the room for those diplomatic conversations, but I have no doubt he made an impact, whether speaking with a Kiwi drawl or, as some suspected, adopting a touch of the American accent mid conversation.I didn't have the privilege of knowing Jim well personally, but since becoming Prime Minister, I received a few quiet phone calls from him. They were short, sincere, and thoughtful. He offered encouragement, perspective, and advice—advice that I took seriously. I also remember campaigning with him in a bar in Waikanae and him still holding court in a room full of people, sharp as ever, fully engaged, loving politics, and very much enjoying himself. He'd just turned 87.Not long ago, he celebrated his 90th birthday, surrounded by family, including eight of his nine children. He and Joan, who has stood steadfastly by his side since their marriage in 1963, were immensely proud, and rightly so.On behalf of the Government and the people of New Zealand, I extend our deepest condolences to Jim's wife Joan, his children and grandchildren, and all of those who knew and loved him.In closing, I want to use Jim's own words, written just a few weeks ago after the death of his friend Tā Tumu Te Heuheu. He said, \"He was, in simple terms, a very good person who was interested in helping others. Farewell, old friend, and may God welcome you home.\" Those words now speak for Jim himself. Thank you.\n\nRt Hon CHRIS HIPKINS (Leader of the Opposition): [Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]The Labour Party joins with the Government in paying tribute to Jim Bolger, the 35th Prime Minister of New Zealand. I vividly remember the very first time I ever met Jim Bolger in person. I was in the sixth form at Hutt Valley Memorial College. Jim Bolger was the Prime Minister and New Zealand had just won the America's Cup. I was one of the lucky few students selected to come and be part of the official welcome reception for the victorious America's Cup team as they arrived home in New Zealand. While everyone else was rushing around the room, gathering the signatures of the victorious sailors, I was collecting the signatures of all the politicians—there were warning signs even back then!But I met Jim Bolger and he was incredibly generous with his time. He took a genuine interest in younger New Zealanders. I think he asked more questions of me than I asked of him, and he was genuinely engaged and interested in the answers. He wanted to understand how New Zealanders saw what was happening in our country at the time and what we thought needed to happen in the future.I wasn't hugely political at the time. I didn't really understand politics very much. That changed relatively quickly over the next couple of years as I went to university and found myself, a couple of years later, out the front of Parliament chanting some rather unsavoury things about Jim Bolger and his Government at that time. Not long after that, Jim Bolger quit Parliament. I'll claim all the credit!But, actually, it was his quitting of Parliament where I got my first taste of election campaigning, because I quickly got involved in politics, ventured up to the King Country by-election, and went doorknocking in Hāwera. I can tell you, as an aspiring Labour Party activist, doorknocking in Hāwera is not a great place to start! We came third in the by-election, but I'm still here.But it was some years later when the gods of Air New Zealand ticketing seated Jim Bolger and I next to each other on a flight to Hamilton and then back again later on that day, that I actually had the opportunity to have quite a long conversation with him. He was flying to Hamilton to chair a University of Waikato Council meeting and I was flying up there to do some education-related visits.I remember that it was late 2016 or early 2017, because the topic of conversation was dominated, at that point, by a certain US presidential election. He was deeply concerned about rising inequality, increasing polarisation, and the fact that so many people around the world seemed to have lost the ability to disagree with each other agreeably. We spent our time sitting together on the plane talking about that. He could see that the concentration of wealth around the world was unsustainable, that the growing marginalisation of large segments of our society was leading to us becoming more divided, and that we could not continue to stand for that. He spoke, in his retired life, of the moral failure of prisons, and I totally agreed with what he was saying there. I think perhaps growing up during the World War II and the long shadow of its aftermath meant that he was very, very aware and had a deep appreciation of the need for us all to constantly strive to find common ground and reconcile our differences. In the conversations that I had the privilege of having with him, we did manage to find a lot of common ground and I enjoyed all of the subsequent encounters that I had with him. He would refer to me as young Chris even once I'd become Prime Minister, and he had a knack for offering his insights and wisdom without ever coming across as patronising or condescending. He did seem genuinely interested, not just in my political career, which he clearly had been following, but in the political careers of emerging politicians across the House. I think perhaps it's a wisdom that you get after you leave this place, that recognition that Governments come and Governments go, but the good interests of the country do rest with whomever the Government happens to be at any given time. He remained a mentor and a friend to anyone in this House who sought out his guidance.From the conversations that I had with him, though, I did get the sense that he struggled to reconcile his own values with the consequences of some of the things that happened during his time in politics, including during the time that he was Prime Minister. I've subsequently come to accept that that's a bit of a curse of all political leaders who happen to be in the hot seat during times of significant turmoil. It's perhaps the ones who don't wrestle with their conscience later on that we should worry about.Jim Bolger's life is full of contradictions. His Government sold the Bank of New Zealand and then he was the inaugural chair of the new Government-owned Kiwibank. His Government ushered in the Employment Contracts Act and then subsequently he chaired a working group that led to the establishment of fair pay agreements. His Government did more to weaken unions than just about any other, but then in his later years he lamented how small unions had become and the effect that that had had for working people. He sacked Winston Peters from his Cabinet and then formed New Zealand's first MMP coalition with Winston Peters as his Deputy Prime Minister, a Government that transpired to be remarkably stable, much to the frustration of the then Labour Party Opposition. I do want to acknowledge Winston Peters today, the only remaining member of the House who served in Government with Jim Bolger during the time that he was Prime Minister. I also acknowledge you too, Mr Speaker. Your first election victory was Jim Bolger's last election victory. I don't think we'll read too much into any of that.His passing marks the end of an era, but his impact on our nation and our politics will endure for many generations to come. His work to advance Māori and progress Treaty settlements does deserve special mention. I know how much he's held in high regard on marae and with iwi up and down the country. In one of his last interviews, only a couple of weeks ago, actually, ironically with a younger member of the Labour Party, he spoke of his concern that so many New Zealanders now seem scared of the word \"Māori\". He reminded us that when Māori do well, we will all do well. He also offered a sobering warning that until the injustices of the past are addressed and Māori are thriving, we will never be able to truly leave behind our past conflicts.He grew up in Taranaki, was a farmer, and led as Prime Minister with pragmatism, often making tough decisions, but always with a clear vision of the country's future. He understood that the country is not just measured by its GDP or its trade figures but by the health and wellbeing of its people. He believed in Catholic social justice, and I know that his faith was important to him. He was a stoic, accepting that while no leader can ever choose their circumstances, they can choose how they respond to those circumstances. He had the serenity prayer hanging on the wall in his office. He was a staunch republican. He turned down a knighthood on leaving Parliament. He advocated for New Zealand to make its own way in the world. I think it's a huge tribute to him that he was nominated for New Zealand's highest honour, the Order of New Zealand, by a Government comprised of his former rivals.Outside of his time as Prime Minister, he remained deeply involved in public life, always committed to improving the lives of ordinary New Zealanders. Humble, dedicated, passionate—his legacy is woven into the fabric of who we are as a country today.I was reflecting that to some extent his passing bookends that of Mike Moore a few years back. Mike Moore was our last working class Prime Minister, leaving school with no higher qualifications. Jim Bolger remains our last true farming Prime Minister, also leaving with no higher qualifications. Both rose instead through their hard work, political nous, and deep understanding of the lives of ordinary New Zealanders, and their stories remind us that leadership is conferred not by degrees or by titles but through character, conviction, and service.To his family, particularly his wife Joan and his children, I offer my deepest condolences and to the many who knew him and worked alongside him and admired him, you can all take comfort from the fact that his influence continues to guide us and will continue to guide us in the years to come. I thought it was fitting to end with an Irish Catholic proverb recognising his cultural heritage of which I know he was proud: \"May the road rise to meet you. May the wind always be at your back. May the sun shine warm upon your face, the rain fall soft upon your fields. And until we meet again, may God hold you in the palm of his hand.\" Nō reira, tēnā koutou, tēnā koutou, tēnā koutou katoa.\n\nTEANAU TUIONO (Green): Thank you, Mr Speaker.[Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]On behalf of the Greens, I rise to support the motion and to support the tributes to the Rt Hon Jim Bolger. In doing so, we understand that for the entire nation he was a Prime Minister, he was the great helmsman, he did many great things, but first and foremost he was a husband, he was a parent, and he was a grandparent. We would like to acknowledge that he had a big whānau and was a koro many times over. Our thoughts are with his wife, Joan, an Aotearoa community leader in her own right, who worked hard doing travel work and public speaking. We'd also like to send our aroha to his children:Dan, Paul, Brian, Stephen, Bernadette—tēnā koe e hoa—Fiona, Rachael, Matt, and Aidan, and his 18 grandchildren. He had a big whānau who will be hurting today, and I know that they will be missing their koro for many, many years to come.As I was scrolling through social media, I saw many tributes from many Māori communities—communities that he helped to support navigate the Treaty settlement claims. As I looked at the size of his whānau, I had to think that perhaps his deft ability in being able to work with many Māori communities was because he had his own iwi and he had his own hapū. It is on that understanding, I feel that many Māori felt that as well.The Rt Hon Jim Bolger served as Aotearoa's Prime Minister between 1990 and 1997. He held several ministerial positions, being the first Minister of Fisheries, the Minister of Immigration, and the Minister of Labour. He was known for his intelligence and his strong debating and negotiating skills. He also wasn't afraid to work across political lines during Kiwibank and working on fair pay agreements, both under Labour-led Governments. The Hon Chris Hipkins did talk about a demonstration and protest outside that was protesting against his Government, and I think I was there—except I was one of those ones that wasn't collecting signatures from politicians at that particular time.He oversaw some significant reforms, including the introduction of the MMP system—and acknowledging the Rt Hon Winston Peters from those times as well, and that Cabinet as well—the resource management, as well as the first major Treaty of Waitangi settlements in Tainui and Ngāi Tahu. I know that for those iwi in particular, he will be at the forefront of their minds.He believed in Te Tiriti, historical justice, and a collective responsibility to honour our founding agreement. When people questioned him on why Treaty settlements, he responded by saying \"Because it is the right thing to do.\" I read that he reflected on his wife, Joan, who, attending school with children from Parihaka, and him attending Ōpunake School next door, never learnt the history about the land that they were on and what happened at Parihaka. He advocated for us as a country to learn our history and own it, warts and all.I think there's an important lesson for all of us there, as political leaders, as well, because we know that there are ups and downs in this particular place, as well, but being able to navigate those different pressures and to come out the other side and, at times, reach out to the other side of the political divide to work on things like fair pay agreements shows the strength of the man. It also shows that, even in his later years, people who were his friends—and political enemies, may I say?—would continue to reach out to him for advice; this is a mark of a truly remarkable person.I want to just leave us with this quote, which I was reflecting earlier on today. And that is this: \"We should teach our colonial history, because we don't, and this is a huge mistake. You cannot know who you are as a society unless you know your history. Look out across the world and see the extraordinary divisions within societies.\" There are some messages and some lessons from his tenure in this place but also the work that he did outside of Parliament.[Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]\n\nHon DAVID SEYMOUR (Leader—ACT): I rise on behalf of ACT to join other leaders in support of the Prime Minister's motion honouring and acknowledging the life and times and legacy of the Rt Hon Jim Bolger. As others have said, he was a man of a great family. Our thoughts are with Joan, his nine children, and his extended family, who, we all know as politicians, will have made great sacrifices in order for him to contribute to our country.Many people will know the history very well—the changes that occurred in the 1990s, bedding in and continuing a process of economic reform that brought New Zealand into the modern world, and the reconciliation that occurred through the Treaty settlement process, without which, New Zealand today, would be unimaginable. And yet, it's so easy to forget how brave and difficult starting that process of Treaty settlements would have been in 1992. He also presided over an enormous constitutional change where the way that New Zealanders elect their representatives to this House changed, and the structure of New Zealand politics changed with it forever. All of that history is well known. I, myself, am separated by two generations, as a person and as a politician, from Jim Bolger, so I don't have the richness of personal stories that others may be able to tell. However, this morning, on hearing the news, I consulted with some who had served and worked with Jim Bolger for their insights into what that was like and what sort of man and what sort of politician he was. They said to me things like: he was a person with a deep sense of the value of belonging; somebody who had a sense of fairness that could only be described as innate; somebody with a keen respect for the underdog; and somebody who felt a responsibility, not only to bring New Zealand into the future but also somebody who had a deep sense of responsibility to do the right thing. He was somebody who encapsulated many of the qualities of a politician that so many politicians themselves would like to be remembered for and so many people around the world, in so many different countries, would like to see in their leaders. That is an extraordinary legacy, one that we should all be very grateful and gracious to acknowledge in the House today. Our finals thoughts are with those he has left behind. The entire Te Kūiti and King Country community, I know, will be feeling this deeply, as will his extended family and, particularly, Joan and his nine children today. Our thoughts are with them, and our gratitude is to him for the legacy that he has left the modern New Zealand. Thank you, Mr Speaker.\n\nRt Hon WINSTON PETERS (Minister of Foreign Affairs): Today, our thoughts and condolences are rightly with Jim Bolger's family, his wife Joan, their many children, grandchildren, and the rest of his extended family. As a Catholic man of Irish extraction, he will have taken both solace and pride in being surrounded by his large family during his final moments. He could have asked for no better farewell.As always, there are various views of history, but very few have had the benefit of living it, breathing it, and working on it like Jim. Therefore, it's right for this House to acknowledge Jim Bolger's passing. He was, ironically, a republican serving his King Country electorate for 26 years, from 1972 until 1998. As you know, he served as Prime Minister for seven years, leading three terms of Government, which were markedly different to each other in their complexion and their output.Jim is acknowledged for his pride in New Zealand's independent national identity, and the presence of the national museum, Te Papa, here in Wellington is due in large part to his insistence that an institution that tells our history and engenders young and old to take an interest in their history was needed. Again, he was proud of his Irish ancestry and saw an historic parallel in the treatment of Irish nationalists with the mistakes of some former New Zealand Governments with Māori in New Zealand. As a Te Kūiti farmer, he grew up around Māori and saw no reason for difference and every reason for communities to be stronger together.It's often said that Jim Bolger was the last Prime Minister without a university degree. Well, for our sakes, we must hope that that is not true for the future. Jim learned his craft on the farm and in the town halls, and he applied it to the highest elected office in this country. In his earliest years in Parliament, he earned the title \"The Woolshed Orator.\" Jim Bolger was a man of good character, strong morals, and family values; he called for a decent society in 1990, and he did so for good cause. He was, in his own words, \"a red-blooded Irishman by descent, but a very practical Kiwi by practice.\"Now, we were not without our disagreements, but today is not for recalling those moments. Disagreements are, however, fundamental to the democratic project, and that was always understood by Jim. He happily took part in a healthy democratic discussion throughout his life, and, long out of politics, he later reminisced on the raging ideological disputes of his time as Prime Minister and had the reflective courage to admit that mistakes were made. It's true to say that, 29 years ago, in 1996, we formed the first MMP Government. We—he—put differences aside, shook hands on that agreement, and, more importantly, he kept his word.Today, we can and must acknowledge that Jim Bolger contributed to a time of enormous difficulty economically and change to New Zealand. But, of far greater importance than this, we acknowledge the passing of a husband, father, and grandfather. Jim, may God bless you.\n\nDEBBIE NGAREWA-PACKER (Co-Leader—Te Pāti Māori): [Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]I rise on behalf of Te Pāti Māori to acknowledge the passing of the Rt Hon Jim Bolger. We have lost so many great pou this year.Mr Bolger was a Roman Catholic, his politics informed by doctrines of peace, forgiveness, and reconciliation. He also lived near whenua beside Parihaka in Taranaki [Authorised reo Māori text to be inserted by the Hansard Office].[Authorised translation to be inserted by the Hansard Office.]His work around the Cabinet table gave life to the principles of good faith and goodwill unto all. We'll remember Mr Bolger's commitment to restoring the honour of the Crown under Te Tiriti o Waitangi. He knew Te Tiriti o Waitangi promises a place for all in this country, and that we all have love, and should have love, for each other. His leadership serves as a lesson: not to vilify or burn bridges with Māori communities but to embrace each other in the spirit of peace through justice, together owning our past and collaboratively looking towards our future.Te Pāti Māori wishes to honour Mr Bolger in his Catholic tradition with this prayer.[Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]Mr Bolger knowingly expanded political capital for the nation's progress and to address historical injustices. His disposition is described by many who we also spoke to as magnificent, as inclusive, and as, indeed, a proud Irishman—earning him the nickname \"Spud\". For us, Mr Bolger is regarded as the greatest Prime Minister since Michael Savage. He had a legacy that affected the whole country. He heard and saw te iwi Māori.Mr Bolger resisted pressure from what we understand was nicknamed the \"Rat Pack\". I won't name them, but names such as Bill English, Nick Smith, and others were included in it, and it was part of them pursuing neoliberal asset sales. The people who rang us today to make sure that we were sharing some of their stories were part of Government at the time, and the stories that they have to share talk about the actions and indeed—as a previous speaker said—ensured that he knew the art and the dignity and the respect of healthy debate, and when it was time to make sure that we could find a way forward no matter what your politics or parties were. The way that he was able to be a visionary and fight for things ensured that we actually have key national assets that we protect as part of national sovereignty, and that we collectively protect today.Mr Bolger supported Doug Graham in signing historic Treaty settlements with Waikato-Tainui and Ngāi Tahu. Tukoroirangi Morgan rangatira said that Jim Bolger leaves a legacy in the Treaty settlement space that will remain unsurpassed. He modernised the whole process of reconciliation in an effort to bring Aotearoa and New Zealand closer together.In 1995, the people of Parihaka also were met and included by this wonderful man. He had the highest ideals of humanity. He acknowledged Parihaka and its peace and its justice, and that Tohu and Te Whiti were way ahead of their time. He also made comments that are embedded and will remain with Parihaka for as long as we are alive. He acknowledged that peace and justice in New Zealand should be honoured—that is the legacy of Te Tiriti. He remarked that we cannot build a nation on myths of equality that ignore our history, and history delayed must still be history delivered.Te Pāti Māori offers its deepest condolences to the Bolger whānau. We also know that there will be many iwi and hapū who are saddened to hear of his passing.In his later years, Mr Bolger became an adviser and a close confidant of many iwi throughout the motu. Over the coming days, his name will be heard across a number of paepae, recognising his contribution to race relationships, and that ideal towards reconciliation are peace and justice.We will mourn his passing and remember his legacy with deep gratitude and affection. E te rangatira, moe mai rā.\n\nHon PAUL GOLDSMITH (Minister of Justice): Thank you, Mr Speaker. I'll start by acknowledging the Bolger family at this time of loss. Our thoughts and prayers are with them. The word that comes to mind, in relation the former Prime Minister Jim Bolger, is \"decency\". He was a Minister, then Leader of the Opposition, then Prime Minister through some of the most tumultuous times in recent history—times of fierce antagonism—and he came through with most fair-minded people regarding him not as a divisive figure but, instead, as one who brought people together. He could build relationships with people who might have regarded him as the enemy. He was a man of faith. Much has been covered of his career, but I would point out that his first election as Leader of the Opposition, in 1987, was a catastrophic loss, and yet he carried on. It was a different era; he wasn't cast out, and he went on to take the party to a stonking victory in 1990. He was a good manager of Cabinet, and he referred to his experience wrangling, with Joan, nine kids; being able to keep the peace; and move the family along. I think it was similar with the Cabinet; he had some salty characters. My first connection with him was during writing a biography of John Banks, who caused him no end of trouble over his time in Cabinet. I came across a quote from Banksie's diary, when he said, in caucus, \"Sometimes, Mr Bolger, I say things that must really piss you off (the caucus erupted).\" That's how he managed to hold the Cabinet and the caucus together. The media and the country often gently—or not so gently—mocked him as \"Spud\". His plane was Spud One. \"The Great Helmsman\" has been talked about, the way that he said \"confident\" with a K, and the way that he adopted overseas accents when he was overseas. He was never super popular as Prime Minister, but he was respected, and that, in the end, is the most important thing.If we think of his legacies, his biggest, I think—well, a big one—was the contribution to the effort to restore the nation's finances during the 1990s. He'd been part of the Muldoon Cabinet that had resisted change and necessary reform up to 1984. Then, he had to deal with, as Leader of the Opposition, the reforming Labour Government that turned the political landscape upside down, where they almost lost Remuera in 1987. Then he had to confront the dire economic situation in 1990.He didn't approach issues ideologically. He never set out to redesign the State, but he was a realist, and he confronted the scale of the challenge he inherited and faced the problem head on. He didn't flinch when it was not what he would have liked it to be, and pain was acute through 1991 and 1992. Progress was just sufficient for National to get re-elected in 1993, by a whisker. Remember he said, \"Bugger the pollsters.\", at the 1993 election, when they got back in by a whisker? But he led the country through strong period of growth in 1994 and 1995.Another legacy was MMP, and some people will say that he broke a promise he should have kept with the superannuation and kept a promise he should have broken with MMP, and time and history will determine whether that was correct. He also failed in his efforts to make the nation a republic, but at least he tried. But more successful, of course, was his effort in starting Treaty settlements, particularly with Ngāi Tahu and Waikato-Tainui. Jim Bolger, as said, grew up in a small town in Taranaki, in a predominantly Māori community, and was always comfortable amongst Māori. His instincts were fair-minded, and, with Doug Graham and his Cabinet, he set the nation on a process that, 30 years later, is still ongoing, and for which, we continue the work today.Few countries have tried such a thing, to face historic events head on, to acknowledge, and apologise for past misdeeds. It's a process that requires much grace, particularly on the part of Māori, who received back a fraction of what was lost, but, also, to some extent, to the people of the current generation, who are setting aside resources that could be devoted to them right now to settle the sins of earlier generations. He and that generation of Māori leaders, in the 1990s, set us off on an important course, and he will always be remembered for that.Unlike the US system, where presidents often end their second term at the height of their popularity, the New Zealand political system, like the UK system, generally ends with Prime Ministers ending in failure, living by the sword and dying by the sword and being tossed out. John Key, I suppose, would regard himself as the only exception to that. Jim Bolger fell to a coup, but after the dust settled, he no doubt understood that he had achieved a lot for the people of New Zealand.He was \"The Great Helmsman\", and he took his turn at the wheel and steered through many squalls confidently and competently, and we wish his family all the very best.\n\nHon Dr MEGAN WOODS (Labour—Wigram): Tēnā koutou e te Whare. E Jim, moe mai, moe mai, moe mai rā [Rest in peace, Jim]. I rise with the rest of the House to acknowledge the life and the legacy of the Rt Hon Jim Bolger, and to extend my deepest sympathy to Joan and the Bolger family. Losing someone is never easy, regardless of their age or their health. Today, we honour a man whose contributions to Aotearoa New Zealand were both significant and enduring, and I would like to acknowledge his colleagues and those who have worked with him over the years.Jim Bolger was a leader who, it has been writ, confounded expectations. He once remarked that his life was full of ironies, a reflection on his journey from privatising rail in the 1990s to later chairing its renationalised successor; and, as Chris Hipkins had said, from selling the Bank of New Zealand to later chairing Kiwibank. These ironies were, however, not contradictions but evidence of a man who evolved, a man who listened, a man who acknowledged change in his thinking, acknowledged his mistakes, who was open to new thinking, and a man who led with conviction. In an increasingly politicised and polarised world, Jim Bolger's life reminds us that it is possible to work constructively and respectively across political divides. We do not need to agree on everything to find common ground—and this was one of his great strengths.Jim Bolger challenged and confounded me at two pivotal stages of my life. Firstly, as a student at the University of Canterbury in the early 1990s, I held very strong views about the policies of his Government. The \"Mother of all Budgets\", welfare cuts, and the Employment Contracts Act 1991 were deeply at odds with my values. However, it was a lecturer in the history department—a lecturer in New Zealand history who I greatly admired and respected and still do—Tā Tipene O'Regan, that presented a different view of Jim Bolger. In Tā Tipene's Treaty history honours class in 1995, right in the thick of the Ngāi Tahu claim negotiations, I was presented with a view of a Prime Minister with a deep understanding of our history who was prepared to listen and genuinely wanted to address the wrongs of the Crown - Māori relationship. Tā Tipene spoke to us of a man who did what he believed was right, even when it meant standing up to his own team.Years later, as a new Minister, I began regular meetings with Jim in his role as the chair of the Gas Industry Company. These continued throughout our six years in Government, and I always looked forward to these meetings every 12 weeks. His wit, his warmth, his humour, his inquiring mind, and his willingness to engage in robust, respectful dialogue were qualities that I deeply admired. We didn't always agree, it's fair to say, but that was never a problem. What mattered was our constructive relationship, that was built and grounded in mutual respect and a shared commitment to public service. Jim understood, perhaps better than most, the challenges of being a Minister and governing. He was always genuine in that desire to be helpful, and I valued his insights immensely. I also appreciated his fondness for lingering a little longer after meetings, telling his chief executive that this was the \"any-other-business\" section of the agenda and he wanted to indulge in a bit of political gossip. As the member for Wigram, it would be remiss of me not to acknowledge Jim Bolger's role in chairing Kiwibank: a lasting legacy of my friend and predecessor Jim Anderton and a testament to both of those men's belief in a strong, proud, and independent New Zealand. Jim Bolger was a gentleman of New Zealand politics. He led, he listened, he evolved, and he served. Today, we honour his life and his legacy and the example he sent to us all. Thank you, Jim, and may eternal rest grant upon you.\n\nTĀKUTA FERRIS (Te Pāti Māori—Te Tai Tonga): [Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]\n\nHon TAMA POTAKA (Minister for Māori Crown Relations: Te Arawhiti): [Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]When we talk about leadership we often look to the Beehive, to the House, or to the halls of power, but, for Jim Bolger, leadership began in a far simpler and humbler place, at Te Namu, often referred to as Ōpunake—the home of many legends, particularly Wiremu Matakātea, Peter Snell, and my mother. Places around there like Oaonui and Ōeo, Hukunui Manaia—named after Hukunui Manaia—and others, in the grandiose \"Surf Highway 45\". Some people, like our hat-wearing friend Rawiri, talk about State Highway 35, but Debbie and me, we're \"Surf Highway 45\". That's where Jim Bolger was from. Those small coastal towns where he was brought up, Ōpunake and Rahotu, beneath the gaze of Taranaki maunga shaped a man who would go on to lead a nation, a man of respect, a man of responsibility, a man of redistribution, a man of relationships, a man of reciprocity, and a man of mana. It's also a town and a village, Rahotu—just down the road from Parihaka, the location of some of the Crown's most egregious and vicious behaviours against our people in Taranaki—the suspension of habeas corpus and various other measures that symbolise the rule of law. This is rich symbolism given the achievements and the attainments of Jim's contributions in public life, and, today, I celebrate his conviction, and I celebrate his devout determination to serve in the interests of all New Zealanders and to go forward together.Jim told me that he was nominated for the National Party candidacy in the King Country in 1972. He was very late for his nomination, and he was one of six—one of whom was my wife's grandfather, Brian Jones, the son of Pei Te Hurinui. He won that nomination and went on to serve. His maiden speech, of course, spoke of the great reassessment facing the world in recognition that progress must serve people, not just economics. He saw beyond that partisanship, calling for balance between growth and human wellbeing. Of course, that same clarity would define his approach to Te Tiriti o Waitangi, the Treaty of Waitangi. When he came into his great responsibilities, Māori issues were often seen as marginal debates rather than central to the nation's wellbeing. I acknowledge the references, the other evening, in relation to both the te reo Māori petition and also the great hīkoi led by Dame Whina Cooper, and might I also mention the Takaparawhau reimagination that lasted over 500 days.The Waitangi Tribunal's power to hear historical and herstorical grievances was still new when he came into responsibility, and the country was still learning to listen. His approach, alongside people like Bill Birch, like Doug Graham, and, of course, Minister Peters and the Speaker, who were in service of the communities in the country that we serve, in the 1990s. The settlements have been mentioned, but also, beyond the settlements, he observed that those moments in history are not just about winners and losers; they're about reconciling our history and our herstory so that the people of this great country can move forward together with confidence, with determination, with dignity, and with clarity. It's not just signing a document or signing an agreement in principle or deed of settlement and drawing a line under our story; it's also about opening the future possibilities, whether or not that was in his service in Te Urewera with the Te Urewera board, that groundbreaking legislation that enabled Te Urewera to have its own legal identity and personality, but also in the reconciliation redress provided to Parihaka in 2017 and his mahi, alongside Dame Tariana Turia—e mihi ana ki a ia—over there in the west coast. Jim said, \"You cannot build a future on injustice. If you want peace and reconciliation, you must acknowledge the truth.\" Those words are not simply for his time but resonate today. He presided over the recognition of Te Wānanga o Raukawa and Te Wānanga o Aotearoa as wānanga under the relevant education legislation. He also presided at a time when Māori broadcasting emerged. He did not posture. He listened to diverse voices and made space. You saw the transition to MMP, as has been mentioned today, that has ushered in an era of our parliamentary story where there are more Māori MPs than ever before.He wasn't a radical. I remember meeting Jim Bolger for the first time when I was 8 years old in the Raetihi school hall, and my father and I and others had to perform a Ngāti Toa Rangatira ngeri for Jim on his arrival at that time. From what I recall, it was actually the night of the 1984 election—not a fantastic night for the National Party, but a great night to meet Jim Bolger. He wasn't a radical, but, indeed, his leadership and his legacy have enabled a radical transformation of our country, in my humble opinion, for the better. The strength of our nation—as witnessed and heard on his recent conversations with the Hon Nanaia Mahuta on YouTube, if you want to check that out—doesn't just come from the 120 or so of us that sit in this House, in this debating chamber, but from families and whānau, from communities, groups, and organisations, from workers, from business people, and from the different threads that go through that needle. [Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]There is but one eye of the needle through which these threads must all go. He understood that Māori prosperity and the health and wealth of Māori would lift national prosperity and New Zealand prosperity, and that social obligation, economic growth, and spiritual connection are not enemies. They are partners. They live together. These actions demonstrate his commitment to the country, his values and, what I particularly reflect on, respect for whakapapa, for our land and moana, for people, responsibility to act fairly, to deliver on promises, to hold ourselves to account, and also for kotahitanga, where our development, our nation's development, whānau wellbeing, conservation, and economics are not traded off too far against one another—pitted off against one another—but are combined together.He lived, in words of our colleague the Hon Megan Woods, with conviction that progress does not require us to abandon our roots but to affirm and to grow them. As Minister for Māori Crown Relations, Māori Development, Conservation, and Whānau Ora, I carry those challenges and those messages closely—to treat the Treaty not as a relic, but as a living foundation to address the needs of our people and not to just sit in ideology but to drive for outcomes together. We won't build peace by ignoring our past wrongs, or build kotahitanga by amplifying or continuing our divisions, but we build, according to Jim, by facing them, by listening, and by honouring our obligations to one another.My grandfather Ivan Len James worked on the farm of Jim Bolger's father and mother at the back of Rahotu—I won't get into the translation of that word, but maybe the translator can translate for you. He reminded me that Jim was someone who was of the land, for the land, and for the people. Tēnā koutou katoa.\n\nHon WILLIE JACKSON (Labour): Kia ora, Mr Speaker. It's an honour to pay a tribute to Jim Bolger. It's been all so wonderful listening to all the kōrero today, but one of the things that I think that's been missed in the kōrero, with respect, is that Jim Bolger, I felt, had an incredible wit. As you know, Mr Speaker, he had great, great humour. The last time I saw him—and I always liked to go up to him and have a bit of a chat—I said to him, \"You know when we were in the union movement, Jim, we hated you with a vengeance—you know, like we hated your guts.\" He said to me, \"Willie, tell me something new—tell me something new, I've heard it all before.\", and I said, \"Oh, OK. Well, I've got something new for you there, Jim. When we were in the union movement, a number of us younger guys had all sworn that if we saw you on the street, we'd punch you right between the eyes. It was either you or Muldoon.\" He laughed his head off. He said, \"Is that your Māori or Pākehā side coming out?\" I said, \"Definitely Pākehā side!\"So I remember him with all this wit, and people talk about him being such a contradiction—I mean, he destroyed us at union level. You know the Employment Contracts Act. There was a time, as you well remember, Mr Speaker, that when you joined a job, you joined the union. You know, there was no option in those days. I loved those days—bring back those days, I say. I was a young, militant union official, and this bloke Bolger turned up and he was the Minister of Labour. Oh man, and in those days, if you thought we had the hīkoi march—that was huge, as we all know—there were marches to rival those hīkoi marches. Bill Andersen, Ken Douglas—this was the union movement at the time. We all swore that we'd get to Bolger, but we were all unsuccessful, as you well know. I just thought, \"One day, if I ever catch up with this Mr Bolger\", and one day, I did. It was in a Jim Anderton - Labour Government, and old Jim, for some reason, he'd had a sort of a turn-around. He became our chairman of Kiwibank. Later on—I mean, we're talking about someone who oversaw the fair pay review—I said to him, \"I didn't think you were the same bloke.\", and he goes, \"I was always the same bloke. You know, I'm Jim from Te Kūiti, where your mother was born, Willie Jackson—where your mother was born.\"So those sort of reminders and his sort of style, it just really showed you that someone could cross over, and he is a person who crossed over, as we've heard today. I want to say to everyone, it's great when we hear this type of kōrero because, in my view, Jim—and I've heard particularly from Te Pāti Māori, I love some of that kōrero coming out—you're talking about the most significant and influential National leader of the last two generations with regards to Māori and race relations.I want to mihi to him in his whānau today: to his beautiful wife Joan and to his daughter Bernadette, who worked with us when we were Ministers. A wonderful, wonderful family, and, as he said, \"It's the Irish and the Māoris, Willie. There's a connection there.\", and I have to agree. But it was a fascinating life—and what a life. Who would have believed that someone who left school at 15 years old, with no qualifications, goes on to become the Prime Minister and the Leader of the National Party? You know, we want more of those sort of people in the National Party. We're hoping—myself and now Chippy, our leader over here—that one day that will happen. It is such an opportunity today to mihi to him and his whānau and to his contribution, because his commitment in terms of te ao Māori has to be remembered. His courage has to be saluted. I think all the speakers have done that today—all the speakers have done that today. It was courage, and I heard \"Goldie\"—or Minister Goldsmith, I should say—talking about it. It was not an easy time back in 1995-96 to actually bring the Treaty settlements together. We can sort of kid ourselves and say that \"Oh well, everything's wonderful now. Tipene's got $2 billion in terms of Ngāi Tahu, and Tainui is flying.\", but Māoridom were protesting in 1995-96, like you would not believe. My uncles Sid and Moana Jackson were leading a lot of that protest in terms of what the Government was doing. But the Prime Minister held to the principle that justice had to be redressed, had to be settled, and although 2 percent of a settlement or of a loss didn't really go to where it should have done, because for—and I heard Megan Woods talking about Ngaī Tahu. the Ngāi Tahu settlement was worth $16 billion to $18 billion. That's what the economists told us, and they settled for $170 million. They settled because of the leadership and innovativeness of Tipene. They settled also because of the strength of Jim Bolger and Doug Graham and a National Government who, I think, and who Māori believe, should be remembered and should be saluted—and that's a lot coming from me, Mr Speaker, I tell you.But we remember that time well. We remember that time well and although there was protests and although the settlements were not where they should have been, we had a Prime Minister who was fixed on justice, who was fixed on redress, who was fixed on Māori getting the acknowledgement they deserved because he believed that if Māori were strong, then this country would be strong. And I salute him. I salute his courage, his whānau, his people. [Authorised reo Māori text to be inserted by the Hansard Office.][Authorised translation to be inserted by the Hansard Office.]\n\nBARBARA KURIGER (National—Taranaki-King Country): Thank you, Mr Speaker. It's a privilege to stand in the House today and speak, as the current Taranaki-King Country MP, on the death of James Brendan Bolger. It's been a very sad and difficult week for the King Country. The heavens have opened this week. There have been five roads, at least, closed and devastation in our community. One can't but help whether this is significant, followed by the death of our previous member of Parliament and Prime Minister.For those who have walked through the street of Te Kūiti in recent years, you may have seen the legends gallery on Rora St. The legends gallery is testament to six legends. We call Te Kūiti the town of legends. It's also the shearing capital of the world, Mike Butterick! We have six people who we really hold in high esteem: Dame Rangimārie Hetet; Les Munro, the Dambuster; Jim Bolger; Koro Wētere; Colin Meads; and our one living legend who is still alive, David Fagan. Those are our local legends in Te Kūiti.There's a history with the Taranaki-King Country electorate. Jim Bolger was elected to Parliament in 1972, as you have heard today—that was my last year in primary school. There has been one member of Parliament between Jim Bolger and myself, and that was Shane Ardern. So, for 53 years, the King Country has been represented by the three of us in various formats before and since MMP. The one significant thing that may not have come to most people's attention is that we all went to Opunake High School, all three of us. It's probably a coincidence, but something very special that we share and something that the school is very proud of. The other thing was that Jim Bolger and I were both members of Rahotu Young Farmers at different times. We were in debating teams, obviously at different times, but he was a great mentor to the young farmers who came along post his time. All of his life, he has been a contributor to society. I can remember as a young married couple with our young family, we hosted a potluck dinner with the Prime Minister the Rt Hon Jim Bolger at our house in Ōaonui. That was when the Taranaki-King Country electorate came all the way round to where David MacLeod's  current electorate is. So that was a significant event, and little did I know that, a few years later, he would be one of my predecessors as I then stood for Parliament.What is also little known is that my husband, Louis, has an auntie Anna who is married to Paddy Bolger, who is Jim Bolger's brother. So, in a way, Jim is whānau.It was a great pleasure when I first came into Parliament, for Jim's 80th birthday. My EA Samantha at the time—Samantha Laming—was a great cakebaker, so we asked her to make a cake for the Rt Hon Jim Bolger for his 80th birthday. She was very nervous, as you can imagine, for a young EA. So I rang Auntie Anna, and I said, \"We're going to decorate a cake for Jim. How should we decorate it?\" She said, \"I think there are two options: one, you can either make it in an Irish theme; or the other theme I would give you is 'don't fence me in.' \" We ended up making it in the shape of a leprechaun hat and made it very Irish. To Samantha's credit, it was great. We took it up to the 19th floor of Bowen House, to Chris Finlayson's office, and we had coffee and cake. It was a wonderful occasion.So it's been a pleasure to be in the electorate. Jim is held in high esteem. I had his desk for quite some time, and we did ask him if he wanted it back. It is now with Ko Wai Au, which is a whānau community support group, a non-profit community organisation, which is very fitting.It's really interesting: somebody sent me this little box a few years ago, and it was presented to the Rt Hon James B. Bolger, Prime Minister, on the occasion of the launch of the Hellenic New Zealand Congress, Parliament Buildings, 2 September 1995. They said, \"Can you find a way to get this back to Jim Bolger?\" And I said, \"Yes.\" So I picked up the phone and I gave him a call. I always appreciated his phone calls and I knew I could pick up the phone and call him when I needed to, too. I rang him and he said, \"Barbara, I think I have enough things at my house. I don't think I need to collect any more things.\" He said, \"You can hold this and you can look after this for me.\"So he's obviously a very well-respected man. I will say in the comments today from Debbie Ngarewa-Packer and Tākuta Ferris, I went to Opunake High School, as I mentioned, a number of years after Jim Bolger, and we didn't know much about Parihaka when I went to school, either. So it was a sad history and I'm really glad that people like Jim Bolger has been able to contribute to where we have got to today, and may we continue in his legacy.The last thing I just want to do is to wish the very best, and pass on my regards, to his wife, Joan, and his family. All his family are contributors. When Jim left Parliament, he didn't stop contributing; he was contributing right to the point where he just couldn't contribute any more. So rest in peace, Jim Bolger. You can be sure you will remain a legend in the King Country, and we will never forget you. Thank you.\n\nTIM COSTLEY (National—Ōtaki): I'm going to miss \"Sir Jim\", and I know he wasn't a fan of knighthoods, but when we met, I told him he'd been Prime Minister for seven years and I was going to call him \"Sir\". We compromised on once a day, and so that's my one done.Jim grew up on the farm in Taranaki, just down the road from my mum's family, and I first met him, actually, at my gran's funeral. He'd been a bit busy during my teenage years running the country, but I remember thinking it was pretty cool that the just recently retired Prime Minister would turn up to my gran's funeral. But the thing I learnt about him, and Joan, to be fair, is that they always took the time. If Mum or Uncle Brian were in town, they'd take the time. If I was calling in to visit but I had the kids, it was never a problem. They would take the time for a cup of tea or, if it was after 3, maybe a glass of red wine, or there might be a loan of the trailer to take the green waste to the tip. In fact, when I was overseas with the air force for a few months, he got in touch, suggesting that maybe he should go around and take all my green waste to the tip for me. I said that there was no way I was having a former Prime Minister turn up and take my green waste to the tip, and I got home and saw how much there was and regretted that.But he was always making time for others, whether it was local events or both of my election nights. In fact, in the last election, he had sent me a message saying that look, he had all the family around and he wouldn't make it to our function. But Joan tells the story that an hour in, as the results were coming in, he stood up and announced, \"Right, we're off.\", and they came down and joined us at the Waikanae Bowling Club—very fond memories. They were always making time for others. He was still active right up until the end, helping our council, helping community groups, helping the local Catholic church, and still enjoying frequent visits from the media—I'm not sure we always enjoyed them, but he certainly did. My good friend Chris Bishop was reminding us this morning that when he and Nicola came to run a public meeting with me just a few years ago, after they had finished speaking, there were the usual questions and answers. Maybe five minutes into the questions, Jim came to the front and gave what, with all due respect, now reminds me of committee of the whole House speeches because it wasn't really a question. There was no question mark at the end of it and it went on for quite a while. But, eventually, the questions did start; it was just that they were from the floor, and not for Chris or Nicola. They were for Jim, and he was away. Do you know, I think most residents on the coast have been to a business breakfast or a public meeting that's been hosted by Jim. A lot of the time he hadn't been invited to host them, but inevitably that's where things ended up. I think for people—and maybe my electorate has a slightly older average age than many, but I think they just shut their eyes and it took them back to the 1990s and, while we joke about it, I think they felt safe. I saw how deeply respected he was and how deeply loved. There are many who will feel this loss far more keenly than I will. I think of Joan—perhaps his greatest accomplishment in his 90-plus years. They were an amazing couple. In fact, when they found out one night that Emma, my wife, couldn't come with me to a National Party function—no, they were sending around the Bolger grandchildren to babysit, and from there on in, we were never short of babysitters. I'm not sure Emma appreciated losing the excuse to not turn up as much as Jim and Joan intended, but they always made the time, and do you know what? He was still blue to the core. Sometimes you had to scratch a little further—as we've heard—in his later years, but he was blue to the core right until the end.The phone rang late on a Saturday night just a couple of weeks ago, and I said to Emma, \"I'm not answering it. It's way too late.\" Then I saw whose name was on it—\"OK, I'm answering it.\" Jim always took the time for me, with the regular text messages and phone calls. I would get a summons round to the house if we hadn't caught up for a couple of weeks and we'd chat about the issues of the day, and I'd listen to many stories from his time at the top, as well. Actually, they were often stories from his time as a Minister under Muldoon. He'd talk about being sent overseas for six weeks with almost no accountability. \"It was fantastic.\", he said, and that's when he got to meet the then Vice President George Bush Senior. But it was experiences like that that set him up for the first few years of his time as Prime Minister—he talked about being one of the only small country leaders that had a direct line into the White House—and, of course, for his time as our Ambassador to the US, as well. Perhaps the story I remember the most leads me back to where I started, back in Taranaki. He talked about in 1996, I think it was, when people came to him and said, \"What are we calling Mount Taranaki?\", or, as it was then, Mount Egmont. \"You have to decide, Prime Minister. What's it going to be? Are we going to change from Egmont to Taranaki?\", and Jim in, I think, his deep wisdom said, \"Just let people decide. If they want to call it Egmont, call it Egmont. If they want to call it Taranaki, call it Taranaki.\", but he could see the culture shift that was happening. There was not just that deep wisdom but that strategic patience in that, and I think it has been proven right three decades later. Jim knew that people needed time to adjust and that you can't force instant intergenerational change on people—it doesn't work. Big changes are made one step at a time, and they are far more effective if everyone takes one step together, rather than just a few taking many.The challenges we face today are different, but they're actually kind of just the same. As he said, \"You don't win the battle to lose the war. You can avoid the battle and we can win the war together.\", and I think Jim won many times over. He won for Māori, he won for farmers, he won for a nuclear-free Pacific, he won for the man and woman on the street—whom he understood so well—and he won for Kiwis. He was a leader. He was a leader that preferred to make the right decision over the popular one, and who was willing to wait for the best outcome and not rush into the wrong one, and I think that as a result, maybe he's one of our more underrated leaders but also one of our more respected ones, both because of his values and because of the values that we all hold as a nation. Perhaps there's a lesson in that for all of us.He taught me that when we enter this esteemed House, we need to move from protester to parliamentarian, and that to be a true statesman and a leader takes patience as well as persistence. It takes grace and gravitas; conviction and compromise. It's not just about tearing down people in this House, but building up all of those who live outside of it. So when I look at Mount Taranaki, I remember that Jim showed us a high road. It may be a little longer, it may be a little windier, and it may be a little bumpier at times, but it has room for us all to journey together. Perhaps in this moment—even just for a moment—we can take one step along that road together towards the future that Jim wanted for his family and for ours. To finish, I say to Jim's family in this sacred moment that we think not just of his contribution to country but his commitment to family, right back to when you were all squeezed into that station wagon on those long drives home. We send our love to all of you, and there really are a lot of you, but we send you our love as we mourn your granddad, your father, and your husband. Rest in peace, Jim.\n\nSPEAKER: I want to thank the House for those very fine tributes to the great New Zealander, and, if the House will indulge, make a few comments of my own.I first met Jim Bolger in 1987, and through the subsequent years, saw him at many party functions and was a great admirer of his. He came to a campaign function for me in 1996. Perhaps demonstrating the sort of gentle Irish charm that he had and the warmth that he exerted, when meeting my mother, who was only 5 foot 3 and a very, very petite woman, he looked at her and said, \"How on earth did you end up with a brute like that?\" He was, in his time, a great parliamentarian. He offered a lot of advice to young members when they came in here; we were only with him for a couple of years, I have to say. But one of the things he said is that yesterday doesn't have to be today, and so many of the tributes today, I think, have indicated exactly how much that thought process was guiding him over that period of time.I do want to thank everyone for mentioning Mrs Bolger. She was his rock for such a long period of time, and he delighted in telling people the story of how they met. I won't go into that—that's for someone else. But what I can say is that when I heard that story a number of times, the joy in his eyes was no less for each time that he told that story, and I think that wonderful partnership is something that the whole country should celebrate. I do offer condolences to Joan and to the family for what they'll be feeling at this time.I think I have to say, too, that Jim Bolger loved convivial situations. He loved gatherings of people. He enjoyed, as any true Irishman would, the opportunity to be with other people. I recall that shortly after the formation of the 1996 Government, Doug Kidd invited a number of senior Ministers and members to the Speaker's Lounge for ongoing discussions, which you can imagine involved a lot of, you know—well, basically they loved their whisky. Doug pointed at me and said, \"You come too.\", and so I did, but I found out I was only there to be the waiter. I was quickly dispatched by Jim Bolger to go and find Ian Revell, who played a guitar. He said, \"Get Revell, get his guitar, get him back here. We're going to sing some songs.\" He loved singing—and it's interesting you mentioned that song, Barbara. He did a three-chord version of \"Don't Fence Me In\"—something that I'll never forget—and then a number of Irish songs. But then he dragged everybody out on to the balcony just outside the Speaker's Lounge, drinks in hand, some smoke ascending above their heads, and then he led the group in a resounding rendition of \"Danny Boy\", and you just think to yourself, could a Prime Minister do that today? I'm talking about the whisky, Chris!The reality is that he was able to be himself with those who he worked with. Too often, I think, we have to hide that away because of the malicious nature of social media these days.So we have lost a great New Zealander—no question about that. He was a man of deep Catholic faith. May perpetual light shine upon him. Rest in peace, good and faithful servant. Motion agreed to.SPEAKER: I invite members to stand and observe a period of silence as a mark of respect for our late former Prime Minister.Members stood as a mark of respect.Waiata—\"Whakaaria Mai\"The House adjourned at 3.30 p.m."
  }
]