[
  {
    "headline": "Cross-Party Tributes as Parliament Mourns Passing of Te Pāti Māori MP Takutai Tarsh Kemp",
    "publicationDate": "2025-06-26",
    "summary": "Parliamentary business was suspended on Thursday as MPs from all parties united to mourn the passing of Te Pāti Māori MP for Tāmaki Makaurau, Takutai Tarsh Kemp. Following a solemn announcement from the Speaker, the House dedicated its session to heartfelt tributes before adjourning as a mark of respect. Colleagues from across the political spectrum remembered Kemp as a fierce advocate for her community, a leader in youth development, and a 'ball of energy'.",
    "topicSummaries": [
      {
        "topic": "Parliament Adjourns After Tributes for MP Takutai Tarsh Kemp",
        "content": "The House of Representatives adjourned for the day after members delivered emotional tributes to Te Pāti Māori MP Takutai Tarsh Kemp, who passed away after a period of illness. Elected in 2023 to represent Tāmaki Makaurau, Kemp was remembered for her two decades of service in Māori health and youth development, her leadership of Manurewa Marae, and her work in the hip-hop dance community, for which she was awarded the New Zealand Order of Merit. Speakers from Labour, National, the Greens, and ACT shared personal memories, describing her as a 'vivacious, beautiful person' and a staunch 'mana wahine' who entered politics to create systemic change for her people.",
        "keyExchanges": [
          {
            "speaker": "Hon Carmel Sepuloni (Deputy Leader—Labour)",
            "quote": "So many leave the community front line for politics to try and make systemic change, with the hope that by making that systemic change the ambulance at the bottom of the cliff would be made redundant."
          },
          {
            "speaker": "Hon Willie Jackson (Labour)",
            "quote": "Politics is a funny game. We can be so terrible to each other in the House... but then we can come together for occasions and kaupapa like this. A sudden death can do that. It makes us sort of reassess where we are, our priorities in life, and where we're going."
          }
        ],
        "tags": [
          "Takutai Tarsh Kemp",
          "Te Pāti Māori",
          "Parliament",
          "obituary",
          "Tāmaki Makaurau",
          "Māori politics"
        ]
      }
    ],
    "conclusion": "The premature adjournment of Parliament served as a poignant reminder of the shared humanity that underlies the political contest."
  }
]