{
  "headline": "Historic Taranaki Maunga Bill Enacted as New Legal Person Te Kāhui Tupua; Parliament Advances Māori Purposes Bill and Names Chief Ombudsman",
  "publicationDate": "2025-01-30",
  "summary": "Parliament wrapped a landmark day of policy moves, including the third reading of the Te Pire Whakatupua mō Te Kāhui Tupua/Taranaki Maunga Collective Redress Bill which restores the mountain’s name and grants it legal personhood, and approves a $35 million administration fund. The day also saw the Māori Purposes Bill introduced to modernise governance, the appointment of John Allen as Chief Ombudsman, and the nomination of Derek Tinia Fox to the Representation Commission, signaling ongoing reforms across Treaty settlements, public administration, and governance.",
  "topicSummaries": [
    {
      "topic": "Te Kāhui Tupua/Taranaki Maunga collective redress bill third reading delivers name restoration and $35M admin fund",
      "content": "The Te Kāhui Tupua/Taranaki Maunga Collective Redress Bill reached its third reading, finalising Crown–Māori redress for Taranaki Maunga. The bill formally restores the mountain’s name as Te Papa-Kura-o-Taranaki, confers legal personality on Te Kāhui Tupua, and establishes an administration fund of 35 million dollars to support governance and conservation across eight iwi, while ensuring public access remains. MPs from both sides lauded the milestone as a landmark in Treaty settlements and reconciliation, with next steps focusing on enacting the legislation and implementing the redress arrangements.",
      "keyExchanges": [
        {
          "speaker": "Hon PAUL GOLDSMITH (Minister for Treaty of Waitangi Negotiations)",
          "quote": "Today is a historic day for Ngā Iwi o Taranaki and Te Kāhui Tupua and for the people and the communities of the Taranaki region."
        },
        {
          "speaker": "Hon PAUL GOLDSMITH (Minister for Treaty of Waitangi Negotiations)",
          "quote": "The national park will be renamed Te Papa-Kura-o-Taranaki, and it will remain within the national parks system."
        }
      ],
      "tags": [
        "Taranaki Maunga",
        "Treaty Settlement",
        "Legal personality",
        "Maunga name restoration"
      ]
    },
    {
      "topic": "Māori Purposes Bill introduced to modernise eight Acts and five regulations",
      "content": "The Māori Purposes Bill was introduced via a first reading, proposing a suite of minor, technical amendments to eight Acts and five regulations (with three Acts repealed) to reduce red tape and bolster Māori governance and economic development. It introduces electronic meetings, allows co-chair arrangements, and updates reporting requirements, reflecting a push to modernise the statute book and improve service delivery across Māori organisations. The bill was referred to the Māori Affairs Committee with a target to report back by 30 July 2025.",
      "tags": [
        "Māori Purposes Bill",
        "modernisation",
        "Māori governance",
        "red tape reduction"
      ]
    },
    {
      "topic": "Chief Ombudsman appointment: John Allen named to lead Ombudsman Office",
      "content": "The House moved to appoint John Richard Allen as an Ombudsman for five years and, on taking up the office, as Chief Ombudsman. The Officers of Parliament Committee’s recommendation was supported across parties, commending Allen’s broad public-sector experience. Supporters emphasised the Ombudsman’s independence and essential role in safeguarding public-service accountability, while acknowledging the outgoing Chief Ombudsman’s contributions.",
      "keyExchanges": [
        {
          "speaker": "Hon PAUL GOLDSMITH (Minister for Treaty of Waitangi Negotiations)",
          "quote": "Mr Allen's nomination was supported by all parties across the House."
        }
      ],
      "tags": [
        "Ombudsman",
        "Chief Ombudsman",
        "Public accountability",
        "parliamentary appointments"
      ]
    },
    {
      "topic": "Representation Commission appointment: Derek Tinia Fox named to represent Opposition",
      "content": "Under section 28(3)(b) of the Electoral Act, the House nominated Derek Tinia Fox of Opoutama to be the Opposition’s member of the Representation Commission, which oversees Maori electoral boundaries. The motion was agreed to, formalising the Opposition’s representation on the commission.",
      "tags": [
        "Representation Commission",
        "Māori electoral boundaries",
        "parliamentary appointments"
      ]
    }
  ],
  "conclusion": "A day of historic Treaty settlement milestones, governance modernisation, and high-level public-service appointments underscores a broad push to embed Māori outcomes in law and strengthen institutions."
}