[
  {
    "headline": "Green Co-Leader Suspended in Tense Parliamentary Standoff Over 'Spineless' Comment",
    "publicationDate": "2025-08-13",
    "summary": "Parliament was dominated by high drama as Green Party Co-Leader Chlöe Swarbrick was suspended from the House for refusing to apologise for calling government MPs 'spineless.' The unprecedented move sparked a lengthy procedural debate that overshadowed significant question time clashes on the economy and the government's infrastructure plans. Lawmakers also made progress on major reforms to resource management and local government water services during extended committee debates.",
    "topicSummaries": [
      {
        "topic": "Green Co-Leader Chlöe Swarbrick Suspended Over 'Spineless' Comment",
        "content": "The day's proceedings began with the Speaker demanding Green Co-Leader Chlöe Swarbrick withdraw and apologise for a comment made yesterday in which she described 68 MPs as 'spineless'. After Swarbrick refused, the Speaker moved to have her suspended, a motion that passed along government lines following a procedural error that required a second vote. The move triggered a prolonged debate, with Opposition Leader Chris Hipkins arguing it was an unprecedented departure from parliamentary practice, where members are typically ejected for the day with the matter considered closed. The Speaker defended his decision by citing a 2017 ruling allowing action on incidents with a 'continued impact' and stated a need to raise the standard of debate in the House to combat disrespect and cyberbullying.",
        "keyExchanges": [
          {
            "speaker": "Speaker",
            "quote": "I invite Chlöe Swarbrick to withdraw and apologise for an offensive comment made in the House yesterday."
          },
          {
            "speaker": "Chlöe Swarbrick (Co-Leader—Green)",
            "quote": "I won't be doing that, Mr Speaker."
          }
        ],
        "tags": [
          "parliamentary-procedure",
          "suspension",
          "free-speech",
          "Chlöe-Swarbrick"
        ]
      },
      {
        "topic": "PM Luxon Grilled Over Construction Sector Collapse and Infrastructure Spending",
        "content": "Prime Minister Christopher Luxon faced intense questioning from Opposition Leader Chris Hipkins regarding the government's role in the struggling construction sector, where 755 firms have collapsed in the past year. Hipkins linked the downturn to an 86% cut in State house builds and a pause on transport projects, while Luxon blamed high interest rates inherited from the previous government. The Prime Minister repeatedly deflected direct questions about whether infrastructure spending in 2026 would be higher or lower than in 2023, instead pointing to a long-term $207 billion infrastructure pipeline and a plan to start $6 billion of projects before Christmas.",
        "keyExchanges": [
          {
            "speaker": "Rt Hon Chris Hipkins (Leader of the Opposition)",
            "quote": "So will the Government be spending more on infrastructure in 2026 or less than it did in 2023?"
          },
          {
            "speaker": "Rt Hon Christopher Luxon (Prime Minister)",
            "quote": "As I said in my earlier answer, I can encourage the member that we have strengthened our infrastructure pipeline to now sit at $207 billion. We have $125 billion under construction, $6 billion before Christmas."
          }
        ],
        "tags": [
          "construction",
          "infrastructure",
          "economy",
          "recession"
        ]
      },
      {
        "topic": "Resource Management Amendment Bill Progresses Through Committee Stage",
        "content": "The Resource Management (Consenting and Other System Changes) Amendment Bill advanced through a detailed Committee of the Whole House debate. Discussions focused on significant last-minute government amendments, including new rules to force housing intensification around Auckland's City Rail Link stations. Opposition MPs raised concerns about the speed of the changes and the potential impact on local infrastructure like schools and green space. The debate also covered provisions to streamline the removal of heritage protections from buildings and controversial changes to Otago's regional water plan, which the Green Party described as a 'mess' created by government overreach.",
        "keyExchanges": [
          {
            "speaker": "Helen White (Labour—Mt Albert)",
            "quote": "Is there a commitment from the Minister to make sure that this area gets the schooling that's required, the green space that's required, etc.? Now, I heard a waffly answer on that from the Minister before and I appreciate that there shouldn't be repetition, but a waffly answer is a waffly answer."
          },
          {
            "speaker": "Hon Simon Watts (Minister of Climate Change)",
            "quote": "But I think, in terms of the long-term plan around ensuring that we have the enablement of infrastructure in place to be able to support growth, that's very much the strategy of this Government and that will be implemented by Auckland Council in this instance."
          }
        ],
        "tags": [
          "resource-management-act",
          "housing-density",
          "water-management",
          "legislation"
        ]
      },
      {
        "topic": "Water Services Bill Debated, Focusing on Stormwater and Regulation",
        "content": "MPs debated the operational details of the Local Government (Water Services) Bill during its committee stage. A key point of contention was the management of stormwater networks and the obligations of private landowners, particularly regarding liability for clearing waterways to prevent flooding—an issue highlighted by the Auckland anniversary floods. The Opposition argued the Minister's answers were unsatisfactory and lacked clarity. The committee also scrutinised significant amendments to the Commerce Act, which establishes the economic regulation framework for new water organisations, and to the Resource Management Act, which introduces new national performance standards for stormwater and wastewater.",
        "keyExchanges": [
          {
            "speaker": "Ingrid Leary (Labour—Taieri)",
            "quote": "The kind of opaque answers that we're hearing do nothing to reassure me that there will be clarity about what their duties are, clarity about what the council's duties are—and what they can use within their powers that is lawful—and also who is going to get compensated for what."
          },
          {
            "speaker": "Hon Simon Watts (Minister of Local Government)",
            "quote": "Members are referring to questions that are very clearly in clause 174 of the bill. If you were to have read it, it says—and I'm wasting the House's time, but for the purposes of simplicity—\"Private owner who impairs stormwater flow\"."
          }
        ],
        "tags": [
          "water-services",
          "stormwater",
          "local-government",
          "regulation"
        ]
      },
      {
        "topic": "Education Minister Defends Reforms Amidst Criticism Over Impact on Māori Learners",
        "content": "Te Pāti Māori MP Hana-Rawhiti Maipi-Clarke challenged Education Minister Erica Stanford on her proposed education reforms, questioning their impact on Māori learners and the level of consultation with kura kaupapa providers. The Minister defended the move to replace NCEA Level 1 with a Foundational Award and denied prioritising standardisation over cultural relevance. Minister Stanford also rejected claims that Māori words were being banned from junior reading books, stating that existing words in English-learning books would remain and that her government had produced the first-ever structured literacy books in te reo Māori.",
        "keyExchanges": [
          {
            "speaker": "Hana-Rawhiti Maipi-Clarke (Te Pāti Māori—Hauraki-Waikato)",
            "quote": "How will her decision to ban nearly all Māori words from junior teaching resources impact the Crown's responsibility to actively protect and promote te reo Māori?"
          },
          {
            "speaker": "Hon Erica Stanford (Minister of Education)",
            "quote": "The Māori words in them will remain. In the new books that will round out the series, a dozen or so that still need to be produced, will still contain Māori words, and to say they're being banned is absolutely wrong."
          }
        ],
        "tags": [
          "education",
          "te-reo-Māori",
          "NCEA",
          "kura-kaupapa"
        ]
      },
      {
        "topic": "NZ First Leader Challenges Use of 'Aotearoa' in Parliament",
        "content": "NZ First Leader Winston Peters raised a point of order questioning the use of 'Aotearoa' in a question on the Order Paper, asking who gave the mandate to change the country's name. The Speaker dismissed the challenge, noting Māori is an official language of New Zealand and that the use of Aotearoa has been acceptable for a long time. He stated that this ruling had been made twice before and should not be brought up again, directing Mr Peters to the Standing Orders Committee if he wished to pursue the matter.",
        "keyExchanges": [
          {
            "speaker": "Rt Hon Winston Peters (Leader—NZ First)",
            "quote": "So I want to know why question No. 1 has got a country imputably called \"Aotearoa\", and who gave anybody the mandate to change this country's name?"
          },
          {
            "speaker": "Speaker",
            "quote": "The reality is that Māori is an official language of New Zealand. If that is a name that Māori choose to use to identify the nation, then that is an acceptable thing. It has been for a very long time... I have ruled on this twice, and, therefore, it should not be brought up again."
          }
        ],
        "tags": [
          "Aotearoa",
          "New-Zealand",
          "Winston-Peters",
          "te-reo-Māori"
        ]
      }
    ],
    "conclusion": "The day was defined by a dramatic clash over parliamentary decorum, while pressing debates on the economy and major environmental and water legislation highlighted deep divisions on the nation's path forward."
  }
]