{
  "headline": "NZ Parliament Advances Build-to-Rent and 7AA Repeal as Growth Agenda Gains Momentum, Speed Limits Reversals Begin, and Education Overhauls Roll Out",
  "publicationDate": "2025-01-29",
  "summary": "Parliament spent the day advancing major growth-oriented policies, including a second-reading push for the Overseas Investment Build-to-Rent Amendment Bill and the repeal of Section 7AA from Oranga Tamariki, while committees took up a Customs levies bill. A high-profile transport policy saw blanket speed-limit reductions reversed on dozens of roads, and the government outlined sweeping education reforms designed to sharpen literacy, numeracy, and math outcomes for students. Across questions and debate, the day highlighted tensions around growth, Treaty commitments, and infrastructure funding as ministers defended a pro-growth, reform-focused agenda.",
  "topicSummaries": [
    {
      "topic": "Overseas Investment Build-to-Rent Amendment Bill Second Reading",
      "content": "The Build-to-Rent bill broadened access for overseas investors to acquire built rental developments (20 dwellings or more) under a streamlined pathway, while preserving the foreign-buyers ban. Proponents argued it would unlock liquidity, accelerate housing supply, and complement the existing pathway for new builds, with some suggesting regional adjustments could better serve smaller communities. Opponents cautioned that the threshold should be scrutinised for regional equity and questioned the broader housing market impact, calling for a careful balance between foreign investment and local housing needs. The bill passed the second reading, with further consideration planned in committee.",
      "keyExchanges": [
        {
          "speaker": "Hon Kieran McAnulty (Labour)",
          "quote": "The 20-unit limit, Minister, is the bit where we want to explore more. Now, I note your comments, and fair enough, because this bill is consistent with what was in place for the previous Government around an exemption for new apartments, and the 20-unit limit is consistent with what was in place in other aspects as well. But I want the Minister to consider what missed opportunities there may be if we stick with such a strict threshold."
        },
        {
          "speaker": "Hon Chris Bishop (Minister for Housing)",
          "quote": "Twenty dwellings was chosen as it reflected the existing treatment of build-to-rent developments under the Act, as well as the definition of build-to-rent land in the Income Tax Act, which is largely how the market has defined it to date."
        }
      ],
      "tags": [
        "build-to-rent",
        "threshold",
        "20-dwellings",
        "overseas-investment"
      ]
    },
    {
      "topic": "Oranga Tamariki (Repeal of Section 7AA) Amendment Bill — Second Reading",
      "content": "The government moved to repeal Section 7AA of the Oranga Tamariki Act, arguing the provision created tensions between culture, whānau rights and child safety, and that the welfare of tamariki must take priority. The debate featured strong views on Te Tiriti o Waitangi, with Green Party and Te Pāti Māori speakers arguing that removal could undermine protections and partnerships with Māori communities; Labour defended the repeal as a step towards safeguarding children while preserving strategic partnerships. The committee’s review recommended retaining strategic partnership provisions alongside other duties, but the second-reading debate concluded without a final vote, with the House adjourning before a final decision. The issue remains contestable, highlighting tensions between child welfare objectives and treaty-based partnership principles.",
      "keyExchanges": [
        {
          "speaker": "Hon Willow-Jean Prime (Labour)",
          "quote": "There were submitters who emphasised the importance of culture, whānau, hapū, and iwi connections. I want to be really clear: I have never said that whānau, hapū, and iwi should not play a role in the care of our young people. I support empowering all communities, and the Act already required this prior to the inclusion of 7AA. The repeal of 7AA will not alter that."
        },
        {
          "speaker": "KAHURANGI CARTER (Green)",
          "quote": "This bill is a direct attack on the whakapapa-based approach to caring for tamariki. The Waitangi Tribunal warns that the removal of 7AA will cause actual harm to tamariki Māori."
        }
      ],
      "tags": [
        "7AA",
        "Te Tiriti",
        "child-welfare",
        "care-system"
      ]
    },
    {
      "topic": "Customs (Levies and Other Matters) Amendment Bill First Reading",
      "content": "The bill introduces a levy regime to recover costs for Customs' goods management activities, complements the Waste Minimisation Act with product stewardship fee collection, and aligns GST treatment for imported goods, including refunds for certain returns and warranty scenarios. Proponents emphasised the bill’s focus on fair, transparent cost-recovery and administrative efficiency, with civil society and business voices noting potential impact on small businesses and the need for robust consultation. Labour, Greens, and National all signalled support for moving the bill to committee for public submissions and detailed scrutiny, with reservations noted about implementation and cost trajectories. The bill was read a first time and referred to the Foreign Affairs, Defence and Trade Committee for consideration.",
      "keyExchanges": [
        {
          "speaker": "Hon Jenny Salesa (Labour—Panmure-Ōtāhuhu)",
          "quote": "Labour supports this bill. However, we have a few reservations that we hope the Minister and the coalition Government will take into account as this bill moves through the House."
        },
        {
          "speaker": "Francisco Hernandez (Green)",
          "quote": "product stewardship is very important, and it's not about growth—it's about a circular economy."
        }
      ],
      "tags": [
        "levies",
        "cost-recovery",
        "GST",
        "waste-minimisation"
      ]
    },
    {
      "topic": "Transport — Reversal of blanket speed limit reductions and road-reversal rollout",
      "content": "A speed-limit policy reversal was announced, reversing the prior blanket reductions and targeting 38 roads to revert to 100 km/h by mid-year, with a further 49 sections going out for public consultation. The Wairarapa route on State Highway 2 between Featherston and Masterton was highlighted as returning to 100 km/h, while safety measures include targeted school-area enforcement and drug-driving tests. The dialogue included a procedural exchange about the appropriateness of backbench questions and references to past policy shifts, reflecting a broader debate over how growth-oriented transport changes should be framed and implemented. The policy shift was framed as part of boosting productivity and freight movement, with a continued emphasis on road safety and targeted interventions.",
      "keyExchanges": [
        {
          "speaker": "Hon Chris Bishop (Minister of Transport)",
          "quote": "The previous Government was very interested in imposing untargeted speed limits—"
        },
        {
          "speaker": "Rt Hon Chris Hipkins (Leader of the Opposition)",
          "quote": "Point of order, Mr Speaker. How can it possibly be in order for a Government Minister to use a patsy question from one of their backbenchers to talk about the previous Government being obsessed with something?"
        }
      ],
      "tags": [
        "speed-limits",
        "Wairarapa",
        "SH2",
        "road-safety"
      ]
    },
    {
      "topic": "Education 2025 Curriculum Roll-out",
      "content": "The 2025 school year ushers in a knowledge-rich, year-by-year curriculum across English and mathematics, with a structured literacy focus beginning in early years, a phonics check at 20 and 40 weeks, and up to $5,000 annual funding for extra structured literacy resources for four years. 18,000 teachers are trained or in training, 970 schools received reading-intervention staffing allocations, and nearly half a million maths resources (books, guides) are being distributed to support the new curriculum. The reform emphasizes explicit, evidence-based teaching of reading, writing, and numeracy and aims to lift achievement and close equity gaps, with scalable support through tutoring for years 7-8 students. The opposition includes Green and other parties raising concerns about implementation, funding, and potential overreach, while Labour champions the changes as foundational for future growth.",
      "keyExchanges": [
        {
          "speaker": "Hon Erica Stanford (Minister of Education)",
          "quote": "From this term, 65,000 young New Zealanders starting school will benefit from an internationally comparable, knowledge-rich, and structured curriculum in English and maths."
        },
        {
          "speaker": "Hon Dr Megan Woods (Labour—Wigram)",
          "quote": "We have to balance the breadth of reform with the practical realities of education delivery and ensure a coordinated approach across regions."
        }
      ],
      "tags": [
        "curriculum",
        "structured-literacy",
        "phonics",
        "maths-resources"
      ]
    },
    {
      "topic": "Debate on Prime Minister's Statement — Growth and Economic Direction",
      "content": "The Prime Minister’s statement framed 2025 as a year of action and growth, emphasizing a shift from the prior government’s approach and pledging to advance structural reforms, reduce inflation, and lower interest rates. The Finance Minister and other ministers defended a pro-growth agenda, highlighting measures such as fast-track approvals, RMA reform, and a move to Invest New Zealand to attract foreign investment, while critics argued the government risks privatization and asset sales, emphasizing concerns for regions like the South Island and for social resilience. The exchange underscored ongoing partisan fault lines on how best to revitalise the economy, with the government insisting it is delivering growth and the opposition warning of long-term costs and social consequences. The day culminated in a continued debate, with notable cross-party calls for accountability and caution about privatisation and social services funding.",
      "keyExchanges": [
        {
          "speaker": "Hon Nicola Willis (Minister of Finance)",
          "quote": "It's yes time, because, after several years in which New Zealanders have watched what happens when a Government mismanages the economy and takes its eye off economic growth, they know things have to change."
        },
        {
          "speaker": "Hon Dr Megan Woods (Labour—Wigram)",
          "quote": "We're being told a lot, over the last two days, that we have a Government of yes: 'This is a Government of yes.' I agree with them on that; it's about saying yes to their mates and to the big end of town."
        }
      ],
      "tags": [
        "growth",
        "economy",
        "policy-reform",
        "InvestNZ"
      ]
    }
  ],
  "conclusion": "The day underscored a government-wide push to accelerate growth through housing, infrastructure, and education reforms, while legislative debates revealed deep tensions over treaty considerations, foreign investment, and the social consequences of rapid expansion."
}